[
    {
        "source": {
            "id": null,
            "name": "Gizmodo.com"
        },
        "author": "James Whitbrook",
        "title": "The Marvels' First Clip Is a Body Swapping Brawl",
        "description": "It’s hard to imagine that the next Marvel movie is out in just a few weeks, but here we are—The Marvels is set to fly into cinemas November 10 and we’re only just getting our first extended look at the film. At least it’s a pretty fun one?Read more...",
        "url": "https://gizmodo.com/the-marvels-first-clip-brie-larson-iman-vellani-mcu-1850976400",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/e74693725221bbc110bcabac9193795c.png",
        "publishedAt": "2023-10-31T15:00:00Z",
        "content": "Its hard to imagine that the next Marvel movie is out in just a few weeks, but here we areThe Marvels is set to fly into cinemas November 10 and were only just getting our first extended look at the … [+1048 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Ben Pearson)",
        "title": "The Marvels Underwent Four Weeks Of Reshoots, But Was It Enough?",
        "description": "Nia DaCosta&amp;#39;s The Marvels did four weeks of reshoots, which is more than normal for Marvel Studios but not the longest reshoot period in the studio&amp;#39;s history.",
        "url": "https://www.slashfilm.com/1436036/the-marvels-underwent-four-weeks-reshoots-was-it-enough/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-underwent-four-weeks-of-reshoots-but-was-it-enough/l-intro-1698855476.jpg",
        "publishedAt": "2023-11-01T19:00:20Z",
        "content": "The four weeks of extra time on \"The Marvels\" is not the longest stretch of reshoots in Marvel Studios history. In 2021, \"Doctor Strange in the Multiverse of Madness\" underwent six weeks of reshoots,… [+1273 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Abdul Azim Naushad",
        "title": "The Marvels Popcorn Bucket: Where to Buy the Container, Tub, and LED Cup",
        "description": "As the theatrical debut of The Marvels is fast approaching, fans want to know how to buy The Marvels popcorn bucket, container, tub, and LED cup. Here is all you need to know about the theaters where you can buy the products and the prices. Where to buy The M…",
        "url": "https://www.comingsoon.net/guides/news/1386029-the-marvels-popcorn-bucket-cup-where-to-buy-limited-edition-price-cinemark",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/11/The-Marvels-Popcorn-Bucket.jpg?resize=1200,630",
        "publishedAt": "2023-11-01T15:16:59Z",
        "content": "As the theatrical debut of The Marvelsis fast approaching, fans want to know how to buy The Marvels popcorn bucket, container, tub, and LED cup. Here is all you need to know about the theaters where … [+1618 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Vansh Mehra",
        "title": "The Marvels: Will Thanos Return to the MCU?",
        "description": "The latest trailer for The Marvels has viewers asking “Will Thanos return to the MCU?” Here’s all you need to know about the big villain’s potential return to the Marvel Cinematic Universe. Is Thanos in The Marvels? A new teaser of The Marvels uses an unused …",
        "url": "https://www.comingsoon.net/guides/news/1384294-the-marvels-will-thanos-return-to-mcu-marvel-cinematic-universe",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/10/Is-Thanos-in-The-Marvels.jpg?resize=1200,630",
        "publishedAt": "2023-10-31T13:09:13Z",
        "content": "The latest trailer for The Marvels has viewers asking Will Thanos return to the MCU? Heres all you need to know about the big villains potential return to the Marvel Cinematic Universe.\r\nIs Thanos in… [+1554 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Vansh Mehra",
        "title": "The Marvels Box Office Prediction: Will the Movie Flop or Succeed?",
        "description": "The Marvels is headed our way and all eyes are set on its box office opening. Its first weekend will be a major factor in deciding whether it will succeed or flop for Disney and Marvel. So, here’s all you need to know about The Marvels’ box office predictions…",
        "url": "https://www.comingsoon.net/guides/news/1383510-the-marvels-box-office-prediction-projection-will-it-flop-succeed-cinema-theater",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/10/the-marvels-box-office-prediction.jpg?resize=1200,630",
        "publishedAt": "2023-10-31T14:04:06Z",
        "content": "The Marvels is headed our way and all eyes are set on its box office opening. Its first weekend will be a major factor in deciding whether it will succeed or flop for Disney and Marvel. So, heres all… [+1771 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Dan Girolamo",
        "title": "The Marvels New Clip Highlights Captain Marvel and Ms. Marvel’s Body-Swapping Fights",
        "description": "Marvel Studios has released a new clip from The Marvels, the next movie in the MCU. The Marvels arrives in theaters on November 10. In the clip titled “Friend of Yours,” Carol Danvers/Captain Marvel (Brie Larson) is fighting adversaries at the home of Kamala …",
        "url": "https://www.comingsoon.net/movies/news/1384485-the-marvels-new-clip-highlights-captain-marvel-and-ms-marvels-body-swapping-fights",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/10/Brie-Larson-in-The-Marvels.jpg?resize=1200,630",
        "publishedAt": "2023-10-31T14:34:32Z",
        "content": "Marvel Studios has released a new clip from The Marvels, the next movie in the MCU. The Marvels arrives in theaters on November 10.\r\nIn the clip titled Friend of Yours, Carol Danvers/Captain Marvel (… [+1450 chars]"
    },
    {
        "source": {
            "id": "techradar",
            "name": "TechRadar"
        },
        "author": "tom.power@futurenet.com (Tom Power)",
        "title": "The Marvels' new teaser might have confirmed a major link to Deadpool 3",
        "description": "A new TV spot for the forthcoming Marvel movie has spawned a wild theory among MCU fans.",
        "url": "https://www.techradar.com/streaming/entertainment/the-marvels-new-teaser-might-have-confirmed-a-major-link-to-deadpool-3",
        "urlToImage": "https://cdn.mos.cms.futurecdn.net/GeTTPkg9kwUtbESzxwGJY5-1200-80.jpg",
        "publishedAt": "2023-11-01T10:51:35Z",
        "content": "Potentially big spoilers follow for The Marvels.\r\nA new teaser for The Marvels has landed online – and it's sent Marvel fans into a frenzy over a potentially big story spoiler.\r\nOrdinarily, TV spots … [+5036 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Dark Horizons"
        },
        "author": "Garth Franklin",
        "title": "“The Marvels” Tops Poll As Russo Draws Ire",
        "description": "Despite some social media negativity towards “The Marvels,” the film is still on track to open next Friday and has now topped a new poll of the most anticipated titles for the rest of the year. Fandango’s poll says the title came out on top of other titles co…",
        "url": "https://www.darkhorizons.com/the-marvels-tops-poll-as-russo-draws-ire/",
        "urlToImage": "https://cdndh.darkhorizons.com/wp-content/uploads/2023/10/the-marvels-tops-poll-as-russo-draws-ire.jpg",
        "publishedAt": "2023-10-31T21:02:54Z",
        "content": "Despite some social media negativity towards “The Marvels,” the film is still on track to open next Friday and has now topped a new poll of the most anticipated titles for the rest of the year.\r\nFand… [+1245 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Spencer Legacy",
        "title": "The Marvels Director Began a New Movie During MCU Sequel’s Postproduction",
        "description": "The Marvels director Nia DaCosta apparently began working on another movie while the upcoming Marvel Cinematic Universe sequel was in postproduction. Variety‘s new Marvel Studios report revealed that the director moved to London earlier in the year to begin p…",
        "url": "https://www.comingsoon.net/movies/news/1386167-the-marvels-director-began-a-new-movie-during-mcu-sequels-postproduction",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/11/the-marvels-header.png?resize=1200,630",
        "publishedAt": "2023-11-01T15:46:52Z",
        "content": "The Marvels director Nia DaCostaapparently began working on another movie while the upcoming Marvel Cinematic Universe sequel was in postproduction.\r\nVarietys new Marvel Studios report revealed that … [+1149 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "CBM (Comic Book Movie)"
        },
        "author": "JoshWilding",
        "title": "THE MARVELS Beats AQUAMAN AND THE LOST KINGDOM To Be Named Fandango's Most Anticipated Holiday Movie",
        "description": "Despite some of the online negativity currently surrounding The Marvels, the movie is clearly one a lot of people are excited about if this poll conducted by ticket retailer Fandango is any indication...",
        "url": "https://comicbookmovie.com/captain-marvel/the-marvels/the-marvels-beats-aquaman-and-the-lost-kingdom-to-be-named-fandangos-most-anticipated-holiday-movie-a207541",
        "urlToImage": "https://comicbookmovie.com/images/articles/banners/207541.jpg",
        "publishedAt": "2023-10-31T16:54:42Z",
        "content": "For whatever reason, there's a great deal of negativity surrounding The Marvels. Much of that can likely be traced back to the same people who review-bombed Captain Marvel in 2019 because, if the cli… [+3160 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Gizmodo.com"
        },
        "author": "Cheryl Eddy",
        "title": "The Marvels' Blazing Final Trailer Is Here",
        "description": "The first Marvels trailer dropped all the way back in April, giving us our first good glimpse of the movie’s superhero-switcheroo hijinks. Now, of course, we know a lot more about the Captain Marvel sequel—but of course Marvel can’t resist one last tease befo…",
        "url": "https://gizmodo.com/marvels-final-trailer-mcu-brie-larson-captain-marvel-1850995367",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/35972f1ab605ade65c36f25f0772bf8f.jpg",
        "publishedAt": "2023-11-07T02:54:00Z",
        "content": "The first Marvels trailer dropped all the way back in April, giving us our first good glimpse of the movies superhero-switcheroo hijinks. Now, of course, we knowa lot more about the Captain Marvel se… [+1130 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Gizmodo.com"
        },
        "author": "James Whitbrook",
        "title": "Nia DaCosta Explains Why She Finished The Marvels Remotely",
        "description": "Amid a sea of salacious reports about the current hectic state of Marvel Studios in a report by Hollywood trade Variety last week—including rumors that the studio could attempt to reunite its original Avengers stars for a new film—one unexpected detail that s…",
        "url": "https://gizmodo.com/nia-dacosta-captain-marvel-2-production-controversy-1850995316",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/2703e80201c535eb7cf61e8bff3bc122.png",
        "publishedAt": "2023-11-06T17:30:00Z",
        "content": "Amid a sea of salacious reports about the current hectic state of Marvel Studios in a report by Hollywood trade Variety last weekincluding rumors that the studio could attempt to reunite its original… [+2374 chars]"
    },
    {
        "source": {
            "id": "ars-technica",
            "name": "Ars Technica"
        },
        "author": "Jennifer Ouellette",
        "title": "Final trailer for The Marvels recalls past Avengers as a new threat looms",
        "description": "\"We destroyed Thanos. But it's not over.\"",
        "url": "https://arstechnica.com/culture/2023/11/final-trailer-for-the-marvels-recalls-past-avengers-as-a-new-threat-looms/",
        "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/11/marvel1-760x380.jpg",
        "publishedAt": "2023-11-07T14:23:29Z",
        "content": "9 with \r\nBrie Larson's Carol Danvers/Captain Marvel takes on a new Kree villain named Dar-Benn in The Marvels.\r\nFor whatever reasonsuperhero fatigue, disappointing performances by Marvel's last few f… [+6095 chars]"
    },
    {
        "source": {
            "id": "polygon",
            "name": "Polygon"
        },
        "author": "Austen Goslin",
        "title": "What to catch up on before you see The Marvels",
        "description": "The Marvels is almost here, here’s how to catch up on the adventures of Kamala Khan, Captain Marvel, and Monica Rambeau before you see the movie",
        "url": "https://www.polygon.com/23951009/marvels-what-to-watch-catch-up-secret-invasion",
        "urlToImage": "https://cdn.vox-cdn.com/thumbor/NpLnDdpegSY7hDwKWhdVhO0OYsU=/769x0:3840x1608/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23612610/BKP1740_102_comp_v007.1039_R2.jpg",
        "publishedAt": "2023-11-08T16:59:31Z",
        "content": "The next installment of the Marvel Cinematic Universe is almost here, and that means its time to catch back up on everything you may have forgotten. In the case of The Marvels, that means refreshing … [+1924 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Digital Trends"
        },
        "author": "Jason Struss",
        "title": "The Marvels just might be the MCU’s first huge box office disaster",
        "description": "With The Marvels, the MCU might experience its first major box office disaster.",
        "url": "https://www.digitaltrends.com/movies/the-marvels-mcu-first-box-office-bomb/",
        "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/11/the-marvels-1.jpg?resize=1200%2C630&p=1",
        "publishedAt": "2023-11-06T15:30:05Z",
        "content": "Until now, “superhero fatigue” was a convenient phrase to explain away multiple DCEU bombs, any Sony superhero movie not starring Tom Holland, or the odd random reboot like David Harbour’s woeful Hel… [+2659 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Gizmodo.com"
        },
        "author": "Sabina Graves",
        "title": "The Marvels' Nia DaCosta Explains Why She Made a Family-Powered Movie",
        "description": "Image: Marvel Studios\r\nMarvel Studios is tapping into the majorly cosmic powers of Captain Marvel, Carol Danvers (Brie Larson); Ms. Marvel, Kamala Khan (Iman Vellani); and Photon, Monica Rambeau (Teyonah Parris) by fueling them with the power of family.In a s…",
        "url": "https://gizmodo.com/interview-nia-dacosta-the-marvels-centers-family-mcu-1850996502",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/31f2dc59068e074d96f81d8246976ba8.jpg",
        "publishedAt": "2023-11-07T16:30:00Z",
        "content": "Marvel Studios is tapping into the majorly cosmic powers of Captain Marvel, Carol Danvers (Brie Larson); Ms. Marvel, Kamala Khan (Iman Vellani); and Photon, Monica Rambeau (Teyonah Parris) by fueling… [+2350 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Digital Trends"
        },
        "author": "Jason Struss",
        "title": "Is Marvel (finally) going to introduce the X-Men into the MCU in The Marvels?",
        "description": "It’s only been about three years since the last X-Men movie but already fans miss those merry band of mutants. Sure, the movies weren’t perfect, and some, like X-Men Origins: Wolverine and X-Men: Apocalypse, were outright bad, but they still had a certain cha…",
        "url": "https://www.digitaltrends.com/movies/the-marvels-x-men-intro-in-the-mcu-teased/",
        "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/05/magneto-x2-2.jpg?resize=1200%2C630&p=1",
        "publishedAt": "2023-11-06T14:36:16Z",
        "content": "It’s only been about three years since the last X-Men movie but already fans miss those merry band of mutants. Sure, the movies weren’t perfect, and some, like X-Men Origins: Wolverine and X-Men: Apo… [+2628 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Gizmodo.com"
        },
        "author": "Sabina Graves",
        "title": "The Marvels' First Reactions Are Here, and All Over the Place",
        "description": "Image: Marvel Studios\r\nThe first impressions for The Marvels have hit the internet, and while for some the Marvel Studios flick that soars by the might of its trio of heroes, for others that chemistry is brought down by some wider issuesNia DaCosta’s The Marv…",
        "url": "https://gizmodo.com/the-marvels-critic-reactions-reviews-mcu-brie-larson-1850996175",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/705e316a0766640bc82d7fcb539a150f.jpg",
        "publishedAt": "2023-11-08T05:10:00Z",
        "content": "The first impressions for The Marvelshave hit the internet, and while for some the Marvel Studios flick that soars by the might of its trio of heroes, for others that chemistry is brought down by som… [+880 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "GameSpot"
        },
        "author": "Lan Pitts",
        "title": "The Marvels Director Nia DaCosta Explains Finishing The Movie Remotely",
        "description": "Last week Variety published a report about how some tastemakers and higher-ups at Disney were unhappy and uncertain about the MCU's future. Some concerns were about either having to bring back Avengers alum Scarlet Johannsen and Robert Downey, Jr., as well as…",
        "url": "https://www.gamespot.com/articles/the-marvels-director-nia-dacosta-explains-finishing-the-movie-remotely/1100-6518972/",
        "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1597/15976769/4217565-the-marvels-captain-marvel-2-poster-international.jpg",
        "publishedAt": "2023-11-07T18:03:00Z",
        "content": "Last week Variety published a report about how some tastemakers and higher-ups at Disney were unhappy and uncertain about the MCU's future. Some concerns were about either having to bring back Avenge… [+2028 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "The A.V. Club"
        },
        "author": "Leigh Monson",
        "title": "The Marvels review: The MCU does battle with itself",
        "description": "It’s no secret these days that Marvel is having something of a crisis behind the scenes, completely revamping their approach to continuity-critical storytelling in their television efforts and scrambling to draw audiences back into theaters in a rudderless po…",
        "url": "https://www.avclub.com/the-marvels-film-review-mcu-brie-larson-1851001733",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/b204992e4ebcf309af625ccd796b77f1.jpg",
        "publishedAt": "2023-11-08T17:00:00Z",
        "content": "Its no secret these days that Marvel is having something of a crisis behind the scenes, completely revamping their approach to continuity-critical storytelling in their television efforts and scrambl… [+4875 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "GameSpot"
        },
        "author": "Lan Pitts",
        "title": "The Marvels Post-Credits Sequence Leaked--Massive Spoilers",
        "description": "The post-credit stinger has been a Marvel tradition that started a trend with big-ticket franchise movies where they're almost expected in any feature nowadays. The latest entry for the MCU, The Marvels, will be hitting theaters in just a few days. Still, ear…",
        "url": "https://www.gamespot.com/articles/the-marvels-post-credits-sequence-leaked-massive-spoilers/1100-6519013/",
        "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1597/15976769/4218257-intro-1689925542.jpg",
        "publishedAt": "2023-11-08T17:02:00Z",
        "content": "The post-credit stinger has been a Marvel tradition that started a trend with big-ticket franchise movies where they're almost expected in any feature nowadays. The latest entry for the MCU, The Marv… [+2045 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "The A.V. Club"
        },
        "author": "Peter Scobel",
        "title": "The Marvels: what to watch before the new MCU movie",
        "description": "In Binge Club, our experts break down all the films and TV shows you need to brush up on ahead of The Marvels",
        "url": "https://www.avclub.com/the-marvels-what-to-watch-before-the-new-mcu-movie-1851000708",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/c09a7fa80efd33bc749998804355e582.jpg",
        "publishedAt": "2023-11-07T22:09:04Z",
        "content": "In Binge Club, our experts break down all the films and TV shows you need to brush up on ahead of The Marvels\r\nWe may earn a commission from links on this page."
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (BJ Colangelo)",
        "title": "The Marvels Final Trailer Promises A Moment That Changes Everything",
        "description": "The final trailer for the latest entry in the Marvel Cinematic Universe, The Marvels, has arrived ahead of its release on November 10.",
        "url": "https://www.slashfilm.com/1440150/the-marvels-final-trailer-moment-changes-everything/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-final-trailer-promises-a-moment-that-changes-everything/l-intro-1699328695.jpg",
        "publishedAt": "2023-11-07T03:50:07Z",
        "content": "Ahead of the film's release on November 10, 2023, Marvel Studios debuted the final trailer for \"The Marvels,\" the latest addition to the Marvel Cinematic Universe. Directed by Nia DaCosta (\"Candyman,… [+1598 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "BGR"
        },
        "author": "Chris Smith",
        "title": "The cheap Avengers trick in the final trailer won’t save The Marvels",
        "description": "The Marvels opens on Friday in theaters around the world. With a few days go to, we have a surprising final trailer for it. It’s …\nThe post The cheap Avengers trick in the final trailer won’t save The Marvels appeared first on BGR.",
        "url": "https://bgr.com/entertainment/the-cheap-avengers-trick-in-the-final-trailer-wont-save-the-marvels/",
        "urlToImage": "https://bgr.com/wp-content/uploads/2023/11/the-marvels-trailer-3-final-7.jpg?quality=82&strip=all",
        "publishedAt": "2023-11-08T00:52:00Z",
        "content": "The Marvels opens on Friday in theaters around the world. With a few days go to, we have a surprising final trailer for it. It’s no wonder Marvel is pulling out of the stops to promote the movie in t… [+4472 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "The A.V. Club"
        },
        "author": "Mary Kate Carr",
        "title": "The Marvels director Nia DeCosta addresses report about leaving post-production",
        "description": "Marvel may have a lot of issues to sort through right now, but none of them are Nia DeCosta’s fault. Concerns about how her film The Marvels will perform amid a reportedly confusing storyline and “lengthy” reshoots have plagued the film; further, Variety repo…",
        "url": "https://www.avclub.com/the-marvels-nia-decosta-addresses-mcu-chaos-report-1850995324",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/5d76bafc1d4bcff6a1fd26b60e35877d.jpg",
        "publishedAt": "2023-11-06T17:30:12Z",
        "content": "Marvel may have a lot of issues to sort through right now, but none of them are Nia DeCostas fault. Concerns about how her film The Marvels will perform amid a reportedly confusing storyline and leng… [+4138 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "The A.V. Club"
        },
        "author": "Jen Lennon",
        "title": "The Marvels cheat sheet: What you need to know—and what you don't",
        "description": "When The Marvels premieres on November 11, it will be the 33rd film in the Marvel Cinematic Universe. At this point, the canon timeline is a mess, and it doesn’t help that several new MCU TV series on Disney+ have muddied the water even further. MCU projects …",
        "url": "https://www.avclub.com/the-marvels-plot-mcu-secret-invasion-explainer-1850991339",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/f3bb69e92888d2aa0570a0454a314910.jpg",
        "publishedAt": "2023-11-06T14:00:00Z",
        "content": "When The Marvels premieres on November 11, it will be the 33rd film in the Marvel Cinematic Universe. At this point, the canon timeline is a mess, and it doesnt help that several new MCU TV series on… [+5364 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Sandy Schaefer)",
        "title": "The Marvels Director Admits That MCU Continuity Is Getting Hard To Manage",
        "description": "At a certain point, even The Marvels director Nia DaCosta realized she had to give up trying to make the MCU film work as a standalone story.",
        "url": "https://www.slashfilm.com/1439295/the-marvels-director-admits-mcu-continuity-getting-hard-manage/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-director-admits-that-mcu-continuity-is-getting-hard-to-manage/l-intro-1699287033.jpg",
        "publishedAt": "2023-11-06T18:00:11Z",
        "content": "Viewers got their first taste of the hijinks to come in \"The Marvels\" with \"Ms. Marvel,\" which ended with Kamala inexplicably changing places with Carol and the latter looking completely perplexed to… [+1462 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Ryan Scott)",
        "title": "Is There A Credits Scene In The Marvels? A Spoiler-Free Guide",
        "description": "Do you need to sit through the credits to get a little extra taste of story at the end of Marvel Studios&amp;#39; new movie, The Marvels? Read on to find out!",
        "url": "https://www.slashfilm.com/1440581/the-marvels-credits-scene-spoiler-free-guide/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/is-there-a-credits-scene-in-the-marvels-a-spoiler-free-guide/l-intro-1699378309.jpg",
        "publishedAt": "2023-11-08T18:00:00Z",
        "content": "As far as the importance this scene carries for the future of the MCU? Again, without spoiling anything, this is a very consequential scene. It's the sort of scene that sets the stage for things to c… [+1350 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "The A.V. Club"
        },
        "author": "Sam Barsanti",
        "title": "Final trailer for The Marvels really wants you to think The Avengers are going to show up",
        "description": "Last week, a story came out about some drama going on behind the scenes at Marvel Studios, and one aspect of it was that some people inside have raised the idea of bringing back characters like Scarlett Johansson’s Black Widow and Robert Downey Jr.’s Tony Sta…",
        "url": "https://www.avclub.com/final-the-marvels-trailer-avengers-iron-man-thanos-1850997674",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/d9f402b971cbd7147a8965dc98168a02.jpg",
        "publishedAt": "2023-11-07T03:41:00Z",
        "content": "Last week, a story came out about some drama going on behind the scenes at Marvel Studios, and one aspect of it was that some people inside have raised the idea of bringing back characters like Scarl… [+1724 chars]"
    },
    {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": "Erik Adams",
        "title": "The Marvels Review",
        "description": "Brie Larson, Teyonah Parris, and Iman Vellani go higher, further, faster, baby.",
        "url": "https://www.ign.com/articles/the-marvels-review-brie-larson-samuel-l-jackson-mcu",
        "urlToImage": "https://assets-prd.ignimgs.com/2023/11/08/themarvels-review-blogroll-1-1699461729130.jpg?width=1280",
        "publishedAt": "2023-11-08T17:00:00Z",
        "content": "Comic books are art in hundreds of ways, but perhaps the most undervalued of those ways particularly in superhero comics is their ability to make you belly laugh while wildly tragic events are unfold… [+5518 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "First Showing"
        },
        "author": "Alex Billington",
        "title": "Final Action-Packed Trailer for 'The Marvels' Sci-Fi Superhero Movie",
        "description": "\"She tore a hold in space... there's a different reality bleeding into ours.\" Marvel has another official trailer for the The Marvels sequel, opening in theaters worldwide this weekend. This is a \"let's trying everything\" kitchen sink trailer that opens with …",
        "url": "https://www.firstshowing.net/2023/final-action-packed-trailer-for-the-marvels-sci-fi-superhero-movie/",
        "urlToImage": "https://media2.firstshowing.net/firstshowing/img16/TheMarvelsfinaleyespostermainTW1.jpg",
        "publishedAt": "2023-11-07T14:01:40Z",
        "content": "by Alex BillingtonNovember 7, 2023Source:YouTube\r\n\"She tore a hold in space… there's a different reality bleeding into ours.\" Marvel has another official trailer for the The Marvels sequel, opening i… [+2500 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "IndieWire"
        },
        "author": "Kate Erbland",
        "title": "‘The Marvels’ Review: Even in Its Best Moments, This Scattered Superhero Sequel Demands a Total MCU Reset",
        "description": "Nia DaCosta's \"Captain Marvel\" sequel has moments of real originality and charm — which only makes the rest of it feel like such a baffling waste.",
        "url": "https://www.indiewire.com/criticism/movies/the-marvels-movie-review-1234923772/",
        "urlToImage": "https://www.indiewire.com/wp-content/uploads/2023/11/GRO-09769_R.jpg",
        "publishedAt": "2023-11-08T17:00:00Z",
        "content": "After sinking at least 100 hours of my life over the last 15 years into watching all the Marvel Cinematic Universe films and some of the shows (to say nothing of any subsequent rewatches), there is s… [+7540 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Eurogamer.net"
        },
        "author": "Ed Nightingale",
        "title": "The Marvels was inspired by Final Fantasy 7: Advent Children, says director",
        "description": "The Marvels director Nia DaCosta is a big fan of Final Fantasy 7: Advent Children and even used it as inspiration for the film.\n\nThe latest in the Marvel Cinematic Universe superhero franchise is set for release later this week, with DaCosta admitting to IGN …",
        "url": "https://www.eurogamer.net/the-marvels-was-inspired-by-final-fantasy-7-advent-children-says-director",
        "urlToImage": "https://assetsio.reedpopcdn.com/ff7-rebirth-cloud-trailer-crop.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
        "publishedAt": "2023-11-08T12:32:19Z",
        "content": "The Marvels director Nia DaCosta is a big fan of Final Fantasy 7: Advent Children and even used it as inspiration for the film.\r\nThe latest in the Marvel Cinematic Universe superhero franchise is set… [+1642 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Geeksaresexy.net"
        },
        "author": "Geeks are Sexy",
        "title": "The Marvels’ Final Trailer is Here, and It’s Action-Packed! [Video]",
        "description": "Be there for the moment that changes everything. Watch the final trailer for The Marvels, in theaters this Friday. [Marvel Entertainment]\nClick This Link for the Full Post > The Marvels’ Final Trailer is Here, and It’s Action-Packed! [Video]",
        "url": "https://www.geeksaresexy.net/2023/11/07/the-marvels-final-trailer-is-here-and-its-action-packed-video/",
        "urlToImage": "https://gas-1b43b.kxcdn.com/wp-content/uploads/2023/11/monica.jpg",
        "publishedAt": "2023-11-07T14:04:21Z",
        "content": "Be there for the moment that changes everything. Watch the final trailer for The Marvels, in theaters this Friday."
    },
    {
        "source": {
            "id": null,
            "name": "The Indian Express"
        },
        "author": "Entertainment Desk",
        "title": "Samantha Ruth Prabhu unveils new teaser of The Marvels: ‘Captain Marvel has always been one of my favourite superheroes’",
        "description": "Actor Samantha Ruth Prabhu was in Hyderabad to promote the release of Marvel's upcoming film The Marvels.",
        "url": "https://indianexpress.com/article/entertainment/tamil/samantha-ruth-prabhu-unveils-new-promo-of-the-marvels-captain-marvel-9012079/",
        "urlToImage": "https://images.indianexpress.com/2023/11/Samantha-in-Hyderabad-with-The-Marvels-fans.jpg",
        "publishedAt": "2023-11-03T11:41:21Z",
        "content": "Samantha Ruth Prabhu is at it again. The actor, who came out in support of Captain Marvel in 2019, is once again backing her favourite Marvel character. On Friday, Samantha unveiled a new promo of th… [+1774 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Deadline"
        },
        "author": "Anthony D'Alessandro",
        "title": "‘The Marvels’ With $140M Global Opening, Not Expected To Be Marvelous At Weekend Box Office – Preview",
        "description": "Here’s something we don’t see often: Opening projections plummeting for a Marvel Studios movie. Their latest sequel to 2019’s Captain Marvel, The Marvels, which is also an extension to Disney+ series WandaVision and Ms. Marvel, has seen its weekend forecast c…",
        "url": "https://deadline.com/2023/11/the-marvels-box-office-opening-projection-1235595720/",
        "urlToImage": "https://deadline.com/wp-content/uploads/2023/11/GRO-09556_R-e1699382120955.jpg?w=1024",
        "publishedAt": "2023-11-07T19:46:16Z",
        "content": "Here’s something we don’t see often: Opening projections plummeting for a Marvel Studios movie. \r\nTheir latest sequel to 2019’s Captain Marvel,The Marvels, which is also an extension to Disney+ serie… [+4492 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Deadline"
        },
        "author": "Armando Tinoco",
        "title": "‘The Marvels’ Final Trailer: Avengers Flashbacks & Tessa Thompson’s Valkyrie Make Appearances",
        "description": "The final trailer before the premiere of The Marvels this Friday just dropped during Monday Night Football’s game between the New York Jets and the Los Angeles Chargers. In the preview, Robert Downey Jr.’s Iron Man and Chris Evans’s Captain America make an ap…",
        "url": "https://deadline.com/2023/11/the-marvels-final-trailer-avengers-flashbacks-tessa-thompsons-valkyrie-1235595030/",
        "urlToImage": "https://deadline.com/wp-content/uploads/2023/11/iron-man-tessa-thompson-the-marvels-trailer.jpg?w=1024",
        "publishedAt": "2023-11-07T04:01:21Z",
        "content": "The final trailer before the premiere of The Marvels this Friday just dropped during Monday Night Football’s game between the New York Jets and the Los Angeles Chargers.\r\nIn the preview, Robert Downe… [+1628 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Paul Tassi, Senior Contributor, \n Paul Tassi, Senior Contributor\n https://www.forbes.com/sites/paultassi/",
        "title": "The Final ‘The Marvels’ Trailer Is Transparently Desperate",
        "description": "Marvel is bracing for impact as The Marvels is shaping up to be one of the MCU’s biggest box office bombs, really no matter what the quality of the film ends up being. It’s the wrong film at the wrong time for the MCU",
        "url": "https://www.forbes.com/sites/paultassi/2023/11/07/the-final-the-marvels-trailer-is-transparently-desperate/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/654a3e562db7c140e25012f2/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
        "publishedAt": "2023-11-07T13:43:21Z",
        "content": "The Marvels?\r\nMarvel\r\nMarvel is bracing for impact as The Marvels is shaping up to be one of the MCUs biggest box office bombs, really no matter what the quality of the film ends up being. Its the wr… [+2723 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Deadline"
        },
        "author": "Valerie Complex",
        "title": "‘The Marvels’ Review: A Cosmic Triumph Grounded In Sincerity And Humanity",
        "description": "In an era where the Marvel Cinematic Universe (MCU) frequently shuttles between multiverse escapades and interplanetary conflicts, Nia DaCosta’s The Marvels emerges as a breath of fresh air, eschewing bombast for a nuanced exploration of its characters. DaCos…",
        "url": "https://deadline.com/2023/11/the-marvels-review-cosmic-triumph-grounded-in-sincerity-humanity-1235596559/",
        "urlToImage": "https://deadline.com/wp-content/uploads/2023/10/GRO-09769_R-e1697733255322.jpg?w=1024",
        "publishedAt": "2023-11-08T17:03:30Z",
        "content": "In an era where the Marvel Cinematic Universe (MCU) frequently shuttles between multiverse escapades and interplanetary conflicts, Nia DaCosta‘s The Marvelsemerges as a breath of fresh air, eschewing… [+3365 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Spencer Legacy",
        "title": "The Marvels Presales Trail Behind Black Adam & The Flash",
        "description": "The latest movie in the Marvel Cinematic Universe, The Marvels, looks to be having a rough time when it comes to presales. Deadline has reported that presales for The Marvels are trailing behind two recent DC Studios films — Black Adam and The Flash. The outl…",
        "url": "https://www.comingsoon.net/movies/news/1391496-the-marvels-presales-trail-behind-black-adam-the-flash",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/11/the-marvels-header-1.png?resize=1200,630",
        "publishedAt": "2023-11-06T18:19:04Z",
        "content": "The latest movie in the Marvel Cinematic Universe, The Marvels, looks to be having a rough time when it comes to presales.\r\nDeadline has reported that presales for The Marvels are trailing behind two… [+1357 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Abdul Azim Naushad",
        "title": "The Marvels: Why Is Tessa Thompson’s Valkyrie in the Movie?",
        "description": "Tessa Thompson’s Valkyrie showed up in the recent The Marvels trailer, and fans are wondering why she is in the movie. Here is all you need to know about her role in the film. Why is Valkyrie in The Marvels? Valkyrie is in the Marvels due to her friendship an…",
        "url": "https://www.comingsoon.net/guides/news/1392898-the-marvels-valkyrie-tessa-thompson-king-asgardians",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/11/the-marvels-valkyrie.jpg?resize=1200,630",
        "publishedAt": "2023-11-07T15:20:47Z",
        "content": "Tessa Thompsons Valkyrie showed up in the recent The Marvels trailer, and fans are wondering why she is in the movie. Here is all you need to know about her role in the film. \r\nWhy is Valkyrie in The… [+1744 chars]"
    },
    {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": "Ryan Leston",
        "title": "The Marvels Director ‘Really Wanted’ The Film to Be Under Two Hours",
        "description": "The Marvels director Nia DaCosta has revealed why she wanted to keep the movie under two hours long.",
        "url": "https://www.ign.com/articles/the-marvels-director-really-wanted-the-film-to-be-under-two-hours",
        "urlToImage": "https://assets-prd.ignimgs.com/2023/11/03/themarvels-blogroll-1699047196961.jpg?width=1280",
        "publishedAt": "2023-11-07T14:56:07Z",
        "content": "Its no secret that The Marvels is the MCUs shortest movie ever. Thankfully, theres a good reason for that.\r\nDuring an interview with Digital Spy, filmmaker Nia DaCosta revealed why The Marvels clocks… [+2421 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Nerdist"
        },
        "author": "Maryam Ahmad",
        "title": "The Marvels Shines Brightest When It Focuses on Its Leads",
        "description": "The MCU's latest film, The Marvels, is at its best when it focuses on its core team of Captain Marvel, Ms. Marvel, and Captain Monica Rambeau.\nThe post The Marvels Shines Brightest When It Focuses on Its Leads appeared first on Nerdist.",
        "url": "https://nerdist.com/article/the-marvels-review-excellent-team-dynamic-between-captain-marvel-kamala-khan-monica-rambeau-drives-mcu-movie/",
        "urlToImage": "https://legendary-digital-network-assets.s3.amazonaws.com/wp-content/uploads/2023/07/21070309/Captain-Marvel-Ms-Marvel-Monica-Rambeau-team-up-for-The-Marvels-trailer.jpg",
        "publishedAt": "2023-11-08T17:01:32Z",
        "content": "The Marvels is a planet-hopping, zany MCU outing that is held together by its leads: Carol Danvers (Brie Larson), Kamala Khan (Iman Vellani), and Captain Monica Rambeau (Teyonah Parris). While on the… [+5341 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Paul Tassi, Senior Contributor, \n Paul Tassi, Senior Contributor\n https://www.forbes.com/sites/paultassi/",
        "title": "‘The Marvels’ Arrives As The Third Worst-Reviewed MCU Movie Ever",
        "description": "Now that full reviews are live, The Marvels has debuted with a disappointing, all-important Rotten Tomatoes score.",
        "url": "https://www.forbes.com/sites/paultassi/2023/11/08/the-marvels-arrives-as-the-third-worst-reviewed-mcu-movie-ever/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/654bc9f8269b8b2b140c6174/0x0.jpg?format=jpg&crop=504,284,x0,y0,safe&height=900&width=1600&fit=bounds",
        "publishedAt": "2023-11-08T17:52:44Z",
        "content": "The Marvels\r\nDisney\r\nIf Disney was hoping that hyper-positive reviews may avert a box office cliff for The Marvels, that does not appear like its going to happen. While last nights social media embar… [+2971 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Abdul Azim Naushad",
        "title": "What MCU Movies & TV Shows To Watch Before The Marvels",
        "description": "As The Marvels is approaching its theatrical release date, fans want to know which MCU movies and TV shows they need to see in order to prepare for the film. Here are all the MCU films and TV shows you need to watch. List of movies and TV shows to watch befor…",
        "url": "https://www.comingsoon.net/guides/news/1391219-what-mcu-movies-tv-shows-to-watch-before-the-marvels",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/11/what-to-watch-before-the-marvels.jpg?resize=1200,630",
        "publishedAt": "2023-11-06T15:28:49Z",
        "content": "As The Marvels is approaching its theatrical release date, fans want to know which MCU movies and TV shows they need to see in order to prepare for the film. Here are all the MCU films and TV shows y… [+2716 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Maggie Dela Paz",
        "title": "The Marvels Director Defends MCU Movie’s Short Runtime",
        "description": "In a recent interview with Digital Spy, The Marvels director Nia DaCosta addressed her upcoming Marvel Studios movie’s short runtime, explaining that it was always part of her plan to keep the Brie Larson-led superhero movie under two hours. “I really wanted …",
        "url": "https://www.comingsoon.net/movies/news/1393002-the-marvels-director-defends-mcu-movies-short-runtime",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/11/the-marvels-pic.jpg?resize=1200,630",
        "publishedAt": "2023-11-07T16:21:44Z",
        "content": "In a recent interview with Digital Spy, The Marvels director Nia DaCosta addressed her upcoming Marvel Studios movies short runtime, explaining that it was always part of her plan to keep the Brie La… [+1704 chars]"
    },
    {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": "Alex Stedman",
        "title": "The Marvels Director Used Final Fantasy VII: Advent Children as a Reference When Pitching",
        "description": "The Marvels director Nia DaCosta doesn't just love Final Fantasy VII: Advent Children - she used the 2005 movie as a reference when pitching to Marvel.",
        "url": "https://www.ign.com/articles/the-marvels-director-used-final-fantasy-vii-advent-children-as-a-reference-when-pitching",
        "urlToImage": "https://assets-prd.ignimgs.com/2023/10/10/themarvelsintroducingthemarvelsfeaturette-ign-blogroll-1696965231105.jpg?width=1280",
        "publishedAt": "2023-11-08T00:55:33Z",
        "content": "Fans of Final Fantasy VII: Advent Children, The Marvels director Nia DaCosta isnt only among you she used the computer-animated film as inspiration.\r\nSpeaking to IGN at a recent press junket, DaCosta… [+2279 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Mack Ashworth",
        "title": "The Marvels IMAX Theater List: Where To Watch in US, UK, and Canada",
        "description": "The Marvels IMAX theater list has been confirmed. These are the cinemas where the new MCU movie is being shown in IMAX quality. While more theaters may be added to this list over time, the following cinemas are confirmed to be showing The Marvel in IMAX durin…",
        "url": "https://www.comingsoon.net/guides/news/1394982-the-marvels-imax-theater-list-where-to-watch-us-uk-canada-australia",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/11/The-Marvels-IMAX-Theater-List.jpg?resize=1200,630",
        "publishedAt": "2023-11-08T15:51:43Z",
        "content": "The Marvels IMAX theater list has been confirmed. These are the cinemas where the new MCU movie is being shown in IMAX quality. While more theaters may be added to this list over time, the following … [+5003 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Nerdist"
        },
        "author": "Eric Diaz",
        "title": "THE MARVELS’ Director Reveals Her Dream X-MEN Project Starring Cyclops and Storm",
        "description": "The Marvels director Nia DaCosta has an X-Men related project she's like to tackle, focusing on the team's two most famous field leaders. \nThe post THE MARVELS’ Director Reveals Her Dream X-MEN Project Starring Cyclops and Storm appeared first on Nerdist.",
        "url": "https://nerdist.com/article/the-marvels-director-nia-dacosta-reveals-her-dream-xmen-project-starring-cyclops-and-storm/",
        "urlToImage": "https://legendary-digital-network-assets.s3.amazonaws.com/wp-content/uploads/2023/11/07130845/Cyclops-vs-Storm-featured.jpg",
        "publishedAt": "2023-11-07T22:20:40Z",
        "content": "Director Nia DaCosta has been doing promotion for her upcoming film The Marvels, and of course, questions about the film’s ties to X-Men lore have been brought up. Mainly because one promo for The Ma… [+1730 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Jeff Conway, Senior Contributor, \n Jeff Conway, Senior Contributor\n https://www.forbes.com/sites/jeffconway/",
        "title": "‘The Marvels’ Is A Lighter, Further, Faster Story That Packs A Punch",
        "description": "Starring Brie Larson, Teyonah Parris and Iman Vellani, \"The Marvels\" may not be the most memorable Marvel movie, but its epic fight scenes take it to new heights.",
        "url": "https://www.forbes.com/sites/jeffconway/2023/11/08/the-marvels-is-a-lighter-further-faster-story-that-packs-a-punch/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/654bb1a32e82f76a44e63536/0x0.png?format=png&crop=654,368,x0,y5,safe&height=900&width=1600&fit=bounds",
        "publishedAt": "2023-11-08T17:00:03Z",
        "content": "Brie Larson, Teyonah Parris and Iman Vellani in Marvel Studios' \"The Marvels\"\r\nMarvel\r\nBefore I say anything, if you are seeking The Marvels to hold the same high stakes and ultimately hit on the sam… [+6532 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Mark Hughes, Contributor, \n Mark Hughes, Contributor\n https://www.forbes.com/sites/markhughes/",
        "title": "How ‘The Marvels’ Can Benefit From ‘Taylor Swift: The Eras Tour’ Boost",
        "description": "Can a super-team-up between Taylor Swift and The Marvels bring audiences together so both films top the weekend box office charts?",
        "url": "https://www.forbes.com/sites/markhughes/2023/11/08/how-the-marvels-can-benefit-from-taylor-swift-the-eras-tour-boost/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/654c003209c2c507c2370273/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
        "publishedAt": "2023-11-08T21:47:51Z",
        "content": "Swifties continue to help prop up the 2023 box office, as Taylor Swift: The Eras Tour tops $230 million, taking the #2 spot at the weekend box office with $13.6 million. And the worldwide popularity … [+6635 chars]"
    },
    {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": "Francesca Rivera",
        "title": "The Marvels: A Guide to Everything You Probably Forgot By Now",
        "description": null,
        "url": "https://www.ign.com/articles/the-marvels-a-guide-to-everything-you-probably-forgot-by-now",
        "urlToImage": "https://assets-prd.ignimgs.com/2023/11/03/themarvels-blogroll-1699047196961.jpg?width=1280",
        "publishedAt": "2023-11-05T16:00:00Z",
        "content": "In The Marvels, Carol Danvers (Brie Larson), Monica Rambeau (Teyonah Parris), and Kamala Khan (Iman Vellani) join forces with our favorite one-eyed man of intrigue Nick Fury (Samuel L. Jackson) by co… [+10318 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Joan MacDonald, Contributor, \n Joan MacDonald, Contributor\n https://www.forbes.com/sites/joanmacdonald/",
        "title": "Who Is Park Seo-Joon The Actor Playing Prince Yan In ‘The Marvels’",
        "description": "According to Brie Larson, who plays Carol Danvers in 'The Marvels,' Park is the “most famous person she’s ever worked with.”",
        "url": "https://www.forbes.com/sites/joanmacdonald/2023/11/06/who-is-park-seo-joon-the-actor-playing-prince-yan-in-the-marvels/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6549569b85bf02d562816f57/0x0.jpg?format=jpg&crop=1434,807,x0,y0,safe&height=900&width=1600&fit=bounds",
        "publishedAt": "2023-11-06T21:23:31Z",
        "content": "Park plays Prince Yan in 'The Marvels.'\r\nMarvel Entertainment\r\nSome of the fans eagerly awaiting the release of the film The Marvels may not be familiar with Park Seo-joon, the Korean actor who plays… [+3313 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Daily Beast"
        },
        "author": "Nick Schager",
        "title": "‘The Marvels’ Is Another Fiasco in Marvel’s Road to Ruin",
        "description": "Marvel Studios\r\nThe Marvel ship is sinking, and The Marvels (in theaters Nov. 10) won’t keep it afloat. Director Nia DaCosta’s sequel to 2019’s financially successful if creatively ho-hum Captain Marvel is the first big-screen Marvel Cinematic Universe entry …",
        "url": "https://www.thedailybeast.com/obsessed/the-marvels-review-yet-another-fiasco-in-marvels-road-to-ruin",
        "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1716,w_3051,x_633,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1699458308/ALF1100_comp_WTA_v0061.1040_R_da7cbq",
        "publishedAt": "2023-11-08T17:00:48Z",
        "content": "The Marvel ship is sinking, and The Marvels (in theaters Nov. 10) wont keep it afloat. Director Nia DaCostas sequel to 2019s financially successful if creatively ho-hum Captain Marvel is the first bi… [+6558 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Boing Boing"
        },
        "author": "Rob Beschizza",
        "title": "'The Marvels' bombs with worst MCU opening yet",
        "description": "The age of superhero movies is over. 'The Marvels,' already perceived as the MCU's Hail Mary, failed to crack $48m on its opening weekend. With a $274.8m official budget (and much more spent on marketing), it is all but doomed to be the fall movie season's bi…",
        "url": "https://boingboing.net/2023/11/13/the-marvels-bombs-with-worst-mcu-opening-yet.html",
        "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/11/image-55.png?fit=1200%2C674&ssl=1",
        "publishedAt": "2023-11-13T14:57:22Z",
        "content": "The age of superhero movies is over. 'The Marvels,' already perceived as the MCU's Hail Mary, failed to crack $48m on its opening weekend. With a $274.8m official budget (and much more spent on marke… [+1339 chars]"
    },
    {
        "source": {
            "id": "time",
            "name": "Time"
        },
        "author": "Moises Mendez II",
        "title": "Breaking Down the Ending of The Marvels",
        "description": "The end of the Marvels suggests that big things are coming to the Marvel Cinematic Universe. Here's what happened and what it all means.",
        "url": "https://time.com/6333664/the-marvels-ending-explained/",
        "urlToImage": "https://api.time.com/wp-content/uploads/2023/11/KDR1740_comp_WYE_v007.1072.jpg?quality=85",
        "publishedAt": "2023-11-10T14:00:00Z",
        "content": "In The Marvels, directed by Nia DaCosta, Captain Marvel (Brie Larson), Monica Rambeau (Teyonah Parris), and Ms. Marvel (Iman Vellani) team up to take down Dar-Benn, a Kree revolutionary who is travel… [+3097 chars]"
    },
    {
        "source": {
            "id": "abc-news",
            "name": "ABC News"
        },
        "author": "ABC News",
        "title": "WATCH: 'The Marvels' take over the Las Vegas Sphere",
        "description": "Captain Marvel’s cat Goose, was on full display outside the new, immersive entertainment venue in Las Vegas for \"The Marvels\" premiere this week.",
        "url": "https://abcnews.go.com/Entertainment/video/marvels-las-vegas-sphere-104806737",
        "urlToImage": "https://i.abcnewsfe.com/a/1437c640-804a-4a42-90db-52e980bbd36f/231110_abc_social_marvel_cat_hpMain_16x9.jpg?w=992",
        "publishedAt": "2023-11-10T23:37:56Z",
        "content": "<ul><li>Whats next for Russia? \r\n</li><li>What comes next after Texas school shooting?\r\n</li><li>What's next for abortion rights in America?\r\n</li><li>The new battle for voting rights\r\n</li><li>How w… [+2272 chars]"
    },
    {
        "source": {
            "id": "polygon",
            "name": "Polygon"
        },
        "author": "Susana Polo",
        "title": "Comics lore, timeline questions, and more things to know before seeing The Marvels",
        "description": "The Marvels hits theaters on Nov. 10. Here’s everything you should know about Captain Marvel, Spectrum, and Ms. Marvel’s return to the MCU.",
        "url": "https://www.polygon.com/23949032/the-marvels-post-credits-scene",
        "urlToImage": "https://cdn.vox-cdn.com/thumbor/E80IyR8NCRf0fd1IAJNGyL9_xpM=/0x121:1688x1005/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25063163/THE_MARVELS_27x40_IMAX_Digital_Supplemental_v3_Lg.jpg",
        "publishedAt": "2023-11-09T11:00:00Z",
        "content": "What do you call a Marvel Studios movie based on Marvel Comics set in the Marvel Cinematic Universe featuring Captain Marvel and Ms. Marvel? The Marvels, clearly. Theres no other choice. \r\nWith the M… [+3269 chars]"
    },
    {
        "source": {
            "id": "polygon",
            "name": "Polygon"
        },
        "author": "Tasha Robinson",
        "title": "The big questions we had after The Marvels, and a few answers",
        "description": "What was up with Dar-Benn (not Darbin!), Maria Rambeau, Monica’s costume, Captain Marvel’s MCU timeline, the Secret Invasion connections, and more.",
        "url": "https://www.polygon.com/23955522/marvels-dar-benn-flerkens-ultimate-weapon-aladna",
        "urlToImage": "https://cdn.vox-cdn.com/thumbor/1_Tv9zwUhpyOxWckrTZWWMhXwbM=/409x0:3687x1716/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25068002/TGW1300_TRL_comp_spi_v0414.1101_R.jpg",
        "publishedAt": "2023-11-10T19:02:12Z",
        "content": "The Marvels is the most unexpected fun weve had at a Marvel Cinematic Universe movie in a while, but the admittedly rushed, choppy storyline left us with some questions. What was Dar-Benns whole deal… [+7917 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Gizmodo.com"
        },
        "author": "James Whitbrook",
        "title": "11 Burning Questions We Have After The Marvels",
        "description": "Image: Marvel Studios\r\nThe Marvels is here, and with it, a bunch of updates on just what is going on in the Marvel Cinematic Universe, from Earth, to space, and beyond. But while much of the team-up movie’s big beats are neatly wrapped up by its brisk end, th…",
        "url": "https://gizmodo.com/the-marvels-burning-questions-spoilers-mcu-x-men-binary-1851018063",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/6628d26b187b9ea205cae54aa1ec5c58.jpg",
        "publishedAt": "2023-11-13T20:22:33Z",
        "content": "In the comics, Binary is the superhero identity of Carol Danvers in the 80s, when she was a close ally of the X-Men and had previously had her abilities as Ms. Marvel depoweredand was in fact her de … [+750 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Digital Trends"
        },
        "author": "Joe Allen",
        "title": "5 movies to watch if you liked The Marvels",
        "description": "Did you enjoy the latest MCU movie The Marvels with Brie Larson and are looking for more like it? Then these five movies should be on your list to watch.",
        "url": "https://www.digitaltrends.com/movies/movies-to-watch-if-you-liked-the-marvels-2023/",
        "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/11/the-marvels-1.jpg?resize=1200%2C630&p=1",
        "publishedAt": "2023-11-11T15:00:00Z",
        "content": "The latest entry in the Marvel Cinematic Universe is also the shortest, which means that if you loved the zany, quippy energy of The Marvels, you may be looking for something else worth watching that… [+3622 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Digital Trends"
        },
        "author": "A.A. Dowd",
        "title": "The Marvels review: the MCU’s shortest film is its biggest mess",
        "description": "Captain Marvel teams up with two Disney+ B-listers for the surprisingly shoddy MCU adventure The Marvels.",
        "url": "https://www.digitaltrends.com/movies/marvels-movie-review/",
        "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/11/Marvels2.jpg?resize=1200%2C630&p=1",
        "publishedAt": "2023-11-10T18:01:02Z",
        "content": "Marvel movies have always been product, but they used to be extremely well-oiled product: splashy, gleaming multiplex entertainment that hit its marks with the precision of a Stark Industries missile… [+6331 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Digital Trends"
        },
        "author": "Blair Marnell",
        "title": "What went wrong with The Marvels? 5 reasons why the MCU is in trouble",
        "description": "After a disastrous opening reception, many are asking this question: What went wrong with The Marvels? Here are 5 reasons why the latest MCU movie flopped.",
        "url": "https://www.digitaltrends.com/movies/what-went-wrong-with-the-marvels-five-reasons-why-the-mcu-is-in-trouble/",
        "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/09/The-Marvels-Trailer.jpg?resize=1200%2C630&p=1",
        "publishedAt": "2023-11-11T18:15:04Z",
        "content": "The Marvels | Final Trailer | In Theaters Friday\r\nMarvel and Disney are always scouring the press to get a good pull quote for their films. So for The Marvels, this is what they can use from us here … [+5566 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Digital Trends"
        },
        "author": "Blair Marnell",
        "title": "Here are all the MCU movies and shows you need to watch before The Marvels",
        "description": "Need a crash course on what's happening at Marvel before The Marvels? Then check out these MCU movies and shows so you can be ready for Captain Marvel's sequel.",
        "url": "https://www.digitaltrends.com/movies/here-are-all-the-mcu-movies-and-shows-you-need-to-watch-before-the-marvels/",
        "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/11/The-Marvels-Poster.jpg?resize=1200%2C630&p=1",
        "publishedAt": "2023-11-09T20:30:01Z",
        "content": "Marvel Studios\r\nIn case you hadn’t heard, there’s a new Marvel movie out this week. But if you haven’t gotten around to getting tickets for The Marvels yet, don’t worry, there should be plenty of ava… [+4390 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Digital Trends"
        },
        "author": "Jason Struss",
        "title": "The Marvels: How many post-credits scenes are there in the latest MCU movie?",
        "description": "With every MCU movie, fans have to know: Does it have an end credits scene? DT reveals how many post-credits scenes The Marvels has and who shows up at the end.",
        "url": "https://www.digitaltrends.com/movies/the-marvels-post-credits-scene-explanation/",
        "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/11/the-marvels-poster-a.jpg?resize=1200%2C630&p=1",
        "publishedAt": "2023-11-10T00:00:46Z",
        "content": "Marvel Studios\r\nIt’s November, which means it’s time for the usual seasonal things: holiday movies no one wants to see; too many football games to keep track of; and sales on stuff you probably don’t… [+3524 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Variety"
        },
        "author": "Naman Ramachandran",
        "title": "‘The Marvels’ Debuts Atop U.K., Ireland Box Office as ‘Tiger 3’ Roars",
        "description": "Disney’s “The Marvels” debuted atop the U.K. and Ireland box office with £3.4 million ($4.2 million), according to numbers released by Comscore. However, in keeping with its global bow, the opening was soft as the latest installment in the MCU scored just abo…",
        "url": "https://variety.com/2023/film/box-office/the-marvels-uk-ireland-box-office-tiger-3-1235790192/",
        "urlToImage": "https://variety.com/wp-content/uploads/2023/11/the-marvels-brie-larson.jpg?w=1000&h=562&crop=1",
        "publishedAt": "2023-11-14T12:57:43Z",
        "content": "Disney’s “The Marvels” debuted atop the U.K. and Ireland box office with £3.4 million ($4.2 million), according to numbers released by Comscore. \r\nHowever, in keeping with its global bow, the opening… [+1945 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "GameSpot"
        },
        "author": "Evan Campbell",
        "title": "The Marvels Has The Worst MCU Box Office Debut Ever",
        "description": "Captain Marvel might be the most powerful Avenger, but that didn't help the superhero's sequel at the box office. The Marvels just opened with the worst start ever for the MCU by pulling in $47 million domestically--$110.3 total when adding in international m…",
        "url": "https://www.gamespot.com/articles/the-marvels-has-the-worst-mcu-box-office-debut-ever/1100-6519110/",
        "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1813/18138562/4219718-4218321-4191963-themarvels_27x40.jpg",
        "publishedAt": "2023-11-13T14:31:00Z",
        "content": "Captain Marvel might be the most powerful Avenger, but that didn't help the superhero's sequel at the box office. The Marvels just opened with the worst start ever for the MCU by pulling in $47 milli… [+1842 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "GameSpot"
        },
        "author": "Phil Owen",
        "title": "The Marvels Ending And Mid-Credits Scene Explained",
        "description": "After several months of delay, Marvel's The Marvels has landed in movie theaters. Despite being the shortest movie in the Marvel Cinematic Universe thus far, The Marvels leaves quite an impact--the ending sets up two separate major plot threads for the future…",
        "url": "https://www.gamespot.com/articles/the-marvels-ending-and-mid-credits-scene-explained/1100-6519080/",
        "urlToImage": "https://www.gamespot.com/a/uploads/original/1757/17577455/4219091-marvel%27sthemarvelsendingexplained.jpg",
        "publishedAt": "2023-11-10T00:52:00Z",
        "content": "After several months of delay, Marvel's The Marvels has landed in movie theaters. Despite being the shortest movie in the Marvel Cinematic Universe thus far, The Marvels leaves quite an impact--the e… [+6015 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Space.com"
        },
        "author": "Fran Ruiz",
        "title": "'The Marvels' review: A chaotic cosmic headache",
        "description": "Marvel Studios' latest movie, The Marvels, exhibits all the symptoms of a rusty creative process. Despite some sparse bursts of charm, it lacks quality control.",
        "url": "https://www.space.com/the-marvels-review",
        "urlToImage": "https://cdn.mos.cms.futurecdn.net/yQA59729qsQbupbeLoWcj9-1200-80.jpg",
        "publishedAt": "2023-11-10T14:59:10Z",
        "content": "Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\r\n©\r\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\r\nNew York,\r\nNY 10036."
    },
    {
        "source": {
            "id": null,
            "name": "The A.V. Club"
        },
        "author": "Scott Huver",
        "title": "All The Marvels Easter eggs and references explained",
        "description": "For better or worse, a certain level of fluency in the ever-expanding tapestry of the Marvel Cinematic Universe is required by The Marvels. While the film—which brings together Captain Marvel’s Carol Danvers (Brie Larson), WandaVision’s Monica Rambeau (Teyona…",
        "url": "https://www.avclub.com/the-marvels-easter-eggs-movie-explained-1851008620",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/dc7b591e654f663a4b047700fc73fbb5.jpg",
        "publishedAt": "2023-11-13T14:00:00Z",
        "content": "For better or worse, a certain level of fluency in the ever-expanding tapestry of the Marvel Cinematic Universe is required by The Marvels. While the filmwhich brings together Captain Marvels Carol D… [+10139 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "The A.V. Club"
        },
        "author": "William Hughes",
        "title": "The Marvels raises the question: How many times is Marvel going to tease us with [REDACTED]?",
        "description": "[This story contains big, massive, obvious spoilers for The Marvels. You’ve been warned!]Read more...",
        "url": "https://www.avclub.com/the-marvels-raises-the-question-how-many-times-is-marv-1851013483",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/4eddd250bdcd381c19000d94071da784.jpg",
        "publishedAt": "2023-11-11T02:36:00Z",
        "content": "[This story contains big, massive, obvious spoilers for The Marvels. Youve been warned!]\r\nNia DaCostas The Marvels opens in theaters this weekend, bringing together Brie Larson, Teyonah Parris, and I… [+2656 chars]"
    },
    {
        "source": {
            "id": "techradar",
            "name": "TechRadar"
        },
        "author": "tom.power@futurenet.com (Tom Power)",
        "title": "When is The Marvels coming to Disney Plus?",
        "description": "Want to know when you can watch The Marvels on Disney Plus? We try to answer that question.",
        "url": "https://www.techradar.com/streaming/disney-plus/when-is-the-marvels-coming-to-disney-plus",
        "urlToImage": "https://cdn.mos.cms.futurecdn.net/KrKzGiB9XTxNySUDHHYcN4-1200-80.jpg",
        "publishedAt": "2023-11-10T08:01:25Z",
        "content": "The Marvels has finally arrived in theaters – and fans are already asking one big question: when will the superhero film make its Disney Plus debut?\r\nIt's a burning query that needs addressing, espec… [+3763 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Sandy Schaefer)",
        "title": "Everything You Need To Remember To Enjoy The Marvels",
        "description": "The Marvels is far more than just a sequel to Captain Marvel, so allow us to bring you up to speed on what&amp;#39;s been happening in the MCU lately.",
        "url": "https://www.slashfilm.com/1441807/everything-you-need-remember-enjoy-the-marvels/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/everything-you-need-to-remember-to-enjoy-the-marvels/l-intro-1699466596.jpg",
        "publishedAt": "2023-11-09T10:45:05Z",
        "content": "The kids are alright in the MCU, as we saw in the delightful \"Ms. Marvel.\" The series introduces Iman Vellani (easily the breakout star of Phase 4 of the MCU) as Kamala Khan, a creative, enthusiastic… [+1506 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (William Bibbiani)",
        "title": "There's One Thing The Marvels Does Better Than Avengers: Endgame",
        "description": "Avengers: Endgame is way more financially successful than The Marvels, but at least the new film meaningfully addresses the underlying concerns of its villain.",
        "url": "https://www.slashfilm.com/1445835/one-thing-the-marvels-does-better-than-avengers-endgame/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/theres-one-thing-the-marvels-does-better-than-avengers-endgame/l-intro-1699914793.jpg",
        "publishedAt": "2023-11-14T13:00:14Z",
        "content": "This post contains spoilers for \"The Marvels.\"\r\nIn \"The Marvels,\" Captain Marvel, Ms. Marvel, and Monica Rambeau (the latter of whom, we will, in accordance with Kamala Khan, henceforth call \"Profess… [+1279 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Sandy Schaefer)",
        "title": "What Critics And Fans Are Saying About The Marvels",
        "description": "2023 has been a rough year for the MCU, but does The Marvels end things on a high note? Here&amp;#39;s what critics and fans are saying about the film.",
        "url": "https://www.slashfilm.com/1443799/what-critics-fans-saying-the-marvels/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/what-critics-and-fans-are-saying-about-the-marvels/l-intro-1699635348.jpg",
        "publishedAt": "2023-11-10T17:18:32Z",
        "content": "To say the /Film team is mixed on \"The Marvels\" would be a bit of an understatement. In his review, Jeremy Mathai wrote that \"Vellani's big-screen debut singlehandedly makes 'The Marvels' worth your … [+2198 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (BJ Colangelo)",
        "title": "The Marvels Credit Scene (And That Surprise Character Cameo) Explained",
        "description": "Stay in your seat when the credits start rolling on The Marvels, because the post-credits scene teases a major shake-up for the MCU.",
        "url": "https://www.slashfilm.com/1442608/the-marvels-post-credits-scene-explained/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-credits-scene-explained/l-intro-1699541016.jpg",
        "publishedAt": "2023-11-09T23:00:00Z",
        "content": "This article containsmajor spoilersfor \"The Marvels.\"\r\nWhether you loved it (like I did) or hated it, the latest addition to the Marvel Cinematic Universe, Nia DaCosta's \"The Marvels,\" is mandatory v… [+1519 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Bill Bria)",
        "title": "The Marvels Ending Explained: Let The Sunshine In",
        "description": "The Marvels connects Captain Marvel to the series Ms. Marvel and WandaVision, but here&amp;#39;s a complete guide to everything you need to know about the ending.",
        "url": "https://www.slashfilm.com/1442358/the-marvels-ending-explained/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-ending-explained-let-the-sunshine-in/l-intro-1699498250.jpg",
        "publishedAt": "2023-11-09T22:00:00Z",
        "content": "Dar-Benn makes a plea to the leader of the now-nomadic Skrulls, Emperor Dro'ge (Gary Lewis), on the Skrulls' temporary home of Tarnax: let her relocate the Skrulls and then use the bangle to open a j… [+1530 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "The A.V. Club"
        },
        "author": "Cindy White",
        "title": "The Marvels' cosmic connections: Who's the new villain and why does she hate Captain Marvel?",
        "description": "While Marvel Studios has been keeping plenty under wraps about the Captain Marvel sequel The Marvels, there are a few things we either know or can anticipate about the film. For instance, fans have already met the three heroes who are teaming up for this stor…",
        "url": "https://www.avclub.com/the-marvels-movie-dar-benn-villain-explained-1851005710",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/0f7525c70ee5a390c317548ab117f44c.jpg",
        "publishedAt": "2023-11-09T14:00:00Z",
        "content": "While Marvel Studios has been keeping plenty under wraps about the Captain Marvel sequel The Marvels, there are a few things we either know or can anticipate about the film. For instance, fans have a… [+7275 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "The A.V. Club"
        },
        "author": "William Hughes",
        "title": "The Marvels is headed for one of the MCU's all-time worst box office openings",
        "description": "Whatever your feelings about the current creative state of the Marvel Cinematic Universe, it’s hard to deny that the franchise’s financial issues are becoming more obvious by the week. That’s come into especially tight focus this week, with the release of Nia…",
        "url": "https://www.avclub.com/the-marvels-is-headed-for-one-of-the-mcus-all-time-wors-1851014431",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/100b920bf465c255cf9c38c11cc2e64d.jpg",
        "publishedAt": "2023-11-11T20:21:00Z",
        "content": "Whatever your feelings about the current creative state of the Marvel Cinematic Universe, its hard to deny that the franchises financial issues are becoming more obvious by the week. Thats come into … [+1884 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Jeremy Mathai)",
        "title": "The Marvels Pays Off The Worst Part Of Secret Invasion Ending (Kind Of)",
        "description": "Secret Invasion never really explained why Skrulls couldn&amp;#39;t have a place of their own on Earth like New Asgard, and The Marvels actually rectifies that.",
        "url": "https://www.slashfilm.com/1441875/the-marvels-kinda-pays-off-worst-part-secret-invasion-ending/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-pays-off-the-worst-part-of-secret-invasion-ending-kind-of/l-intro-1699469113.jpg",
        "publishedAt": "2023-11-10T19:00:00Z",
        "content": "Warning: This article contains spoilers for \"The Marvels.\"\r\nLeave it to the Marvel Cinematic Universe to use their 33rd film in the franchise as a sequel (of sorts) to several properties across multi… [+1625 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Ryan Scott)",
        "title": "The Marvels Box Office Was Even Worse Than Expected – What The Heck Happened?",
        "description": "The Marvels, the latest film in the ongoing Marvel Cinematic Universe, significantly stumbled in its opening weekend, marking the worst MCU opening ever.",
        "url": "https://www.slashfilm.com/1445357/the-marvels-box-office-worse-than-expected-what-happened/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-box-office-was-even-worse-than-expected-what-the-heck-happened/l-intro-1699896175.jpg",
        "publishedAt": "2023-11-13T18:00:13Z",
        "content": "It should have been a big weekend at the box office as \"The Marvels,\" the latest entry in the Marvel Cinematic Universe, arrived in theaters. This wasn't just any entry in the multi-billion-dollar fr… [+1493 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Hannah Shaw-Williams)",
        "title": "The Marvels Heads For $47-52 Million Opening Weekend, A Historic Low For The MCU",
        "description": "The Marvels is projected to set an unenviable record for the Marvel Cinematic Universe, with the lowest opening weekend in the franchise&amp;#39;s history.",
        "url": "https://www.slashfilm.com/1444499/the-marvels-box-office-opening-weekend-lowest-mcu/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-heads-for-47-52-million-opening-weekend-an-historic-low-for-the-mcu/l-intro-1699721779.jpg",
        "publishedAt": "2023-11-11T17:10:40Z",
        "content": "For about a decade or so, Marvel Cinematic Universe movies were such a solid bet at the box office that a sequel grossing \"only\" $644 million was considered a low point. But following the departure o… [+1621 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Ethan Anderton)",
        "title": "The Marvels Star Iman Vellani Talks Working With Kittens, Young Avengers & More [Exclusive Interview]",
        "description": "We spoke with The Marvels star Iman Vellani about working with kittens, teasing the Young Avengers, deleted scenes, and who her own personal Captain Marvel is.",
        "url": "https://www.slashfilm.com/1446432/the-marvels-iman-vellani-interview-kittens-young-avengers-credits-scene/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-star-iman-vellani-talks-working-with-kittens-young-avengers-more-exclusive-interview/l-intro-1699981867.jpg",
        "publishedAt": "2023-11-14T18:00:31Z",
        "content": "I have to say, I'm so glad that the actors' strike ended and you were able to talk about this movie. Because after seeing how great you were in it, I was just like, \"Man, it would be a total bummer i… [+3204 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "The A.V. Club"
        },
        "author": "Sam Barsanti",
        "title": "Marvel's The Marvels opens at the top of the weekend box office, and let’s leave it at that",
        "description": "It looks like Marvel Studios’ domination of the U.S. box office continues, with The Marvels—the latest entry in the MCU—opening in the number one spot. Of course… it did also manage to have the worst opening weekend in the history of the franchise, as predict…",
        "url": "https://www.avclub.com/the-marvels-opens-at-the-top-of-the-weekend-box-office-1851015677",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/22d438410cf439da5541450bb7ecd023.jpg",
        "publishedAt": "2023-11-12T22:04:00Z",
        "content": "It looks like Marvel Studios domination of the U.S. box office continues, with The Marvelsthe latest entry in the MCUopening in the number one spot. Of course it did also manage to have the worst ope… [+1527 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Ryan Scott)",
        "title": "The Marvels Is On Track For One Of The MCU's Lowest Box Office Openings",
        "description": "Bad news for The Marvels: the latest from the Marvel Cinematic Universe looks to be headed towards a less-than-great opening weekend at the box office.",
        "url": "https://www.slashfilm.com/1443945/the-marvels-box-office-opening-weekend/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-is-on-track-for-one-of-the-mcus-lowest-box-office-openings/l-intro-1699640970.jpg",
        "publishedAt": "2023-11-10T21:00:00Z",
        "content": "Even in the most optimistic scenario, an over/under $60 million domestic opening for a movie with a budget well north of $200 million is not good. International ticket sales appear to be similarly so… [+1463 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Witney Seibold)",
        "title": "The Marvels Musical Planet Scene Was Originally Longer, And Iman Vellani Loved It [Exclusive]",
        "description": "Iman Vellani loved filming the musical sequence on Aladna in The Marvels but was disappointed to see how much of it was left out of the theatrical cut.",
        "url": "https://www.slashfilm.com/1446867/the-marvels-musical-planet-scene-longer-iman-vellani-loved-it/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-musical-planet-scene-was-originally-longer-and-iman-vellani-loved-it-exclusive/l-intro-1699995259.jpg",
        "publishedAt": "2023-11-14T22:00:55Z",
        "content": "When asked about the cut and/or reshot scenes for \"The Marvels,\" Vellani was forthcoming, saying:\r\n\"There's a longer version of the Aladna dance. I am a musical theater nerd, and I loved it. They sen… [+1523 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Bill Bria)",
        "title": "The Marvels Composer On Going Through 'Marvel College' And Creating Music With 'Space Junk' [Exclusive Interview]",
        "description": "/Film sat down with Laura Karpman, the composer of The Marvels, to talk about finding the sound of the score, getting music out of &amp;#39;space junk,&amp;#39; and more.",
        "url": "https://www.slashfilm.com/1439957/the-marvels-composer-laura-karpman-exclusive-interview/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-composer-laura-karpman-on-going-through-marvel-college-and-creating-music-with-human-voices-exclusive-interview/l-intro-1699490728.jpg",
        "publishedAt": "2023-11-09T18:00:00Z",
        "content": "So when those bigger questions were addressed, how did you go about building your sonic palette for the score? I would love to know more about the human voices, and of course, Evelyn Glennie, who I w… [+1948 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "IndieWire"
        },
        "author": "Brian Welk",
        "title": "Does Marvel Have a Gen-Z Problem? Just 19% of ‘The Marvels’ Audience Was 18-24",
        "description": "Just 19 percent of \"The Marvels\" audience was 18-24; compare that to 40 percent for \"Captain Marvel.\"",
        "url": "https://www.indiewire.com/news/business/marvel-gen-z-problem-viewers-age-18-24-1234925056/",
        "urlToImage": "https://www.indiewire.com/wp-content/uploads/2022/06/JER-102-05569_R.jpg",
        "publishedAt": "2023-11-14T20:00:00Z",
        "content": "Matt Ramos, 22, was just 7 years old when the original “Iron Man” hit theaters. He was not the target audience for the film; nor was his Gen-Z responsible for making Marvel and the MCU a cultural and… [+9111 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Jeff Ames",
        "title": "Box Office Results: The Marvels Fails to Ignite",
        "description": "Disney/Marvel’s The Marvels failed to get off the ground in its debut weekend, collecting a meager $47 million at the domestic box office. The pic ranks as the lowest opening for an MCU film to date, falling short of The Incredible Hulk’s $55M opening in 2008…",
        "url": "https://www.comingsoon.net/movies/news/1399336-box-office-results-the-marvels-fails-to-ignite",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/11/Marvel.png?resize=1200,630",
        "publishedAt": "2023-11-12T20:50:44Z",
        "content": "Disney/Marvels The Marvels failed to get off the ground in its debut weekend, collecting a meager $47 million at the domestic box office. The pic ranks as the lowest opening for an MCU film to date, … [+2590 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Bill Bria)",
        "title": "The Marvels Executive Producer On Working With MCU Continuity And The Magnitude Of Space [Exclusive Interview]",
        "description": "/Film sat down with Mary Livanos, an executive producer of The Marvels, to talk about fitting the film into the MCU&amp;#39;s continuity, its cosmic setting, and more.",
        "url": "https://www.slashfilm.com/1441136/the-marvels-executive-producer-mary-livanos-exclusive-interview/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-executive-producer-on-working-with-mcu-continuity-and-portraying-the-magnitude-of-space-exclusive-interview/l-intro-1699397504.jpg",
        "publishedAt": "2023-11-09T13:00:00Z",
        "content": "So Carol, Kamala, and Monica, they've all already been established in other media, but what was it like for you to make Marvel's first all-female team film? How do you approach balancing characters t… [+2018 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Ryan Scott)",
        "title": "The Marvels Suggests A Strange Plan For The MCU's X-Men – But What Happens Next?",
        "description": "The Marvels mid-credits scene includes quite the surprise for longtime fans of the X-Men movies, but what does this mean for their place in the MCU&amp;#39;s future?",
        "url": "https://www.slashfilm.com/1442979/the-marvels-strange-plan-mcu-x-men-future/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-suggests-a-strange-plan-for-the-mcus-x-men-but-what-happens-next/l-intro-1699554438.jpg",
        "publishedAt": "2023-11-10T16:00:00Z",
        "content": "Warning: This article contains majorspoilersfor \"The Marvels.\"\r\n\"The Marvels\" has finally arrived, and it may well be the last Marvel Cinematic Universe movie to grace our screens for a good while. \"… [+1932 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Rafael Motamayor)",
        "title": "The Marvels Is At Its Best When It's A Sequel To Ms. Marvel",
        "description": "The Marvels gives us three main characters to follow, but it&amp;#39;s Ms. Marvel, aka Kamala Khan, and her whole family who shine the brightest in the sequel",
        "url": "https://www.slashfilm.com/1441600/the-marvels-best-when-sequel-to-ms-marvel/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-is-at-its-best-when-its-a-sequel-to-ms-marvel/l-intro-1699460076.jpg",
        "publishedAt": "2023-11-10T15:00:12Z",
        "content": "Speaking to Variety, director Nia DaCosta described the film as \"really wacky and silly,\" and that is mostly thanks to the Khans and the \"Ms. Marvel\" connection. Captain Marvel is a rather somber cha… [+1976 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Ryan Scott)",
        "title": "The Marvels Box Office Points To A Major Problem In Hollywood, Not Just Marvel",
        "description": "Unfortunately for Disney (and Hollywood in general), larger budgets have become the norm of late. The Marvels is the latest example of why that&amp;#39;s a big problem.",
        "url": "https://www.slashfilm.com/1445692/the-marvels-box-office-major-problem-hollywood/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-box-office-points-to-a-major-problem-in-hollywood-not-just-marvel/l-intro-1699908563.jpg",
        "publishedAt": "2023-11-13T21:00:47Z",
        "content": "The pandemic not only forced Hollywood to shut down for the better part of the year, but it pushed the industry rapidly towards streaming. Disney+ launched and, with that, Marvel needed to become an … [+1793 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "IndieWire"
        },
        "author": "Kate Erbland",
        "title": "‘The Marvels’ Post-Credits Scenes Give Fans Exactly What They Want",
        "description": "Nia DaCosta's \"The Marvels\" ends with a single post-credits scene, but the path forward it hints at seems destined to change the MCU forever.",
        "url": "https://www.indiewire.com/features/general/the-marvels-post-credits-scenes-explained-1234923780/",
        "urlToImage": "https://www.indiewire.com/wp-content/uploads/2023/11/GRO-09556_R.jpg",
        "publishedAt": "2023-11-10T22:00:00Z",
        "content": "[Editor’s note: The following article contains spoilers for both “The Marvels” and its post-credits scene.]\r\nNia DaCosta’s “The Marvels” may end with lots of reveals and game-changers — like Carol Da… [+5003 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Rolling Stone"
        },
        "author": "Brian Hiattt",
        "title": "‘The Marvels’ Star Teyonah Parris Cried When She Learned She Was an MCU Superhero",
        "description": "“I get to be a part of the imagery I wanted to see more of as a young girl,” says Parris, who first appeared as Monica Rambeau in ‘WandaVision.’",
        "url": "https://www.rollingstone.com/tv-movies/tv-movie-features/the-marvels-teyonah-parris-interview-monica-rambeau-mcu-wandavision-1234876027/",
        "urlToImage": "https://www.rollingstone.com/wp-content/uploads/2023/11/teyonah-parris-the-marvels.jpg?w=1600&h=900&crop=1",
        "publishedAt": "2023-11-12T14:50:17Z",
        "content": "The rocky current state of the Marvel Cinematic Universe is partly due to its over-extension into too many streaming shows of varyingquality — but at the same time, the best of those series have intr… [+6855 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Sandy Schaefer)",
        "title": "Don't Feed The Trolls, And Don't Blame The Marvels Director Nia DaCosta For The Film's Box Office",
        "description": "Crappy people online are throwing The Marvels director Nia DaCosta under the bus for the film&amp;#39;s disappointing box office, but that&amp;#39;s objectively inaccurate.",
        "url": "https://www.slashfilm.com/1445413/dont-blame-the-marvels-director-nia-dacosta-for-box-office/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/dont-feed-the-trolls-and-dont-blame-the-marvels-director-nia-dacosta-for-the-films-box-office/l-intro-1699898568.jpg",
        "publishedAt": "2023-11-13T20:00:26Z",
        "content": "What a difference five years can make. This time back in 2018, Marvel Studios was on a red hot streak and was gearing up for the release of \"Captain Marvel,\" another sure-to-be box office gem to add … [+1592 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "IndieWire"
        },
        "author": "Alison Foreman",
        "title": "Fact Checking Flerken Mating Patterns in ‘The Marvels’: Are Kittens Even Cute Anymore?",
        "description": "Goose may be the crowning jewel in the “Captain Marvel” legacy, but the decision to make her inexplicably multiply for the sequel flies in the face of pop culture clichés — and feels painfully 2019.",
        "url": "https://www.indiewire.com/features/commentary/the-marvels-baby-flerkens-cute-sidekick-criticism-1234925519/",
        "urlToImage": "https://www.indiewire.com/wp-content/uploads/2023/11/Flerkens.png",
        "publishedAt": "2023-11-12T15:00:00Z",
        "content": "[Editor’s note: The following contains spoilers for “The Marvels.”]\r\n“The Goose is loose!” That’s something I’d like to think was said by one or more of Nick Fury’s crew members upon discovering that… [+4379 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Theonion.com"
        },
        "author": "Chad Nackers",
        "title": "Men Explain Why Female-Led ‘The Marvels’ Failed",
        "description": "After The Marvels had the Marvel Cinematic Universe’s worst-ever opening weekend, The Onion asked men to explain why the female-led film failed, and this is what they said. Read more...",
        "url": "https://www.theonion.com/men-explain-why-female-led-the-marvels-failed-1851018397",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/56ccd99e39ecb67d9c8e610b57dbcf09.jpg",
        "publishedAt": "2023-11-14T16:40:00Z",
        "content": "Its either the compounding factors of a fatigue with the overwhelming number of these films, their general decline in quality, and the hurdles of being a female-led movie in a male-centric genre, or … [+37 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "First Showing"
        },
        "author": "Manuel São Bento",
        "title": "Review: Nia DaCosta's 'The Marvels' is a Solid Mid-Tier MCU Movie",
        "description": "As someone who enjoyed 2019's Captain Marvel more upon rewatch than during the initial premiere, I approached The Marvels with a mixture of tempered anticipation and curiosity. As everyone is aware, the MCU (Marvel Cinematic Universe) has expanded to include …",
        "url": "https://www.firstshowing.net/2023/review-nia-dacostas-the-marvels-is-a-solid-mid-tier-mcu-movie/",
        "urlToImage": "https://media2.firstshowing.net/firstshowing/img16/TheMarvelsReviewmainimagebigTW1.jpg",
        "publishedAt": "2023-11-09T19:27:22Z",
        "content": "by Manuel São BentoNovember 9, 2023\r\nAs someone who enjoyed 2019's Captain Marvel more upon rewatch than during the initial premiere, I approached The Marvels with a mixture of tempered anticipation … [+7905 chars]"
    },
    {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": "Joshua Yehl",
        "title": "The Marvels Fixes This Deadpool 3 Problem",
        "description": "The mid-credits scene for The Marvels is far more than just an x-citing cameo.",
        "url": "https://www.ign.com/articles/the-marvels-fixes-this-deadpool-3-problem",
        "urlToImage": "https://assets-prd.ignimgs.com/2023/11/10/the-marvels-thumb-1699644083249.jpg?width=1280",
        "publishedAt": "2023-11-11T03:15:00Z",
        "content": "Warning: This article contains spoilers for The Marvels!\r\nThe mid-credits scene for The Marvels gives Marvel fans what theyve long waited for, but probably not in the way they expected. The stinger s… [+5705 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "International Business Times"
        },
        "author": "AFP News",
        "title": "'The Marvels' Has A Far From Marvelous N.America Opening",
        "description": "New superhero film \"The Marvels\" is making history, and not in a good way: its estimated $47 million North American take over the weekend marks the lowest debut ever for a movie from Disney's normally money-cranking Marvel Cinematic Universe.",
        "url": "https://www.ibtimes.com/marvels-has-far-marvelous-namerica-opening-3718316",
        "urlToImage": "https://d.ibtimes.com/en/full/4498712/brie-larson-attends-new-york-showing-marvels-november-10-2023.jpg",
        "publishedAt": "2023-11-13T01:15:30Z",
        "content": "New superhero film \"The Marvels\" is making history, and not in a good way: its estimated $47 million North American take over the weekend marks the lowest debut ever for a movie from Disney's normall… [+2325 chars]"
    },
    {
        "source": {
            "id": "ign",
            "name": "IGN"
        },
        "author": "Scott Collura",
        "title": "The Marvels Post-Credits Scene Check-In (No Spoilers)",
        "description": "You definitely want to stick around through the credits this time.",
        "url": "https://www.ign.com/articles/the-marvels-post-mid-credits-scene-ending-explained",
        "urlToImage": "https://assets-prd.ignimgs.com/2023/11/09/the-marvels-ending-post-credits-thumb-1699489638667.jpg?width=1280",
        "publishedAt": "2023-11-09T23:05:00Z",
        "content": "Let's make this simple: Do you want to know if theres a post-credits scene in The Marvels? The answer is yes -- specifically, there is a mid-credits scene that you'll definitely want to catch. And fo… [+1398 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Nerdist"
        },
        "author": "Michael Walsh",
        "title": "THE MARVELS Post-Credits Scene, Explained",
        "description": "The Marvels only featured one post-credits scene, but it sure was an exciting one. Here's what that shocking moment means for the MCU's future.\nThe post THE MARVELS Post-Credits Scene, Explained appeared first on Nerdist.",
        "url": "https://nerdist.com/article/the-marvels-post-credits-scene-explained-fox-xmen-join-the-mcu/",
        "urlToImage": "https://legendary-digital-network-assets.s3.amazonaws.com/wp-content/uploads/2023/11/09095747/The-Marvels.jpg",
        "publishedAt": "2023-11-10T03:00:00Z",
        "content": "Marvel Studios/Dolby Cinema\r\nThe Marvelsended with one of the group’s three members lost in a parallel universe. The jump point Dar-Benn created over Earth grew even more unstable after she tried to … [+4043 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Mark Hughes, Contributor, \n Mark Hughes, Contributor\n https://www.forbes.com/sites/markhughes/",
        "title": "Review: ‘The Marvels’ Is Exactly The Great, Fun Superhero Movie Marvel Studios Needs",
        "description": "\"The Marvels\" will top the box office this weekend, but the superhero sequel looks sadly destined to underperform.",
        "url": "https://www.forbes.com/sites/markhughes/2023/11/10/review-the-marvels-is-exactly-the-great-fun-superhero-movie-marvel-studios-needs/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/654eb69bd5f6c10b3c542e81/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
        "publishedAt": "2023-11-10T23:38:11Z",
        "content": "Marvel Studios hopes to overcome negative narratives and a merciless 2023 box office environment this weekend with the arrival of The Marvels, a sequel to their billion dollar blockbuster Captain Mar… [+12090 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Livejournal.com"
        },
        "author": "polynucleotide",
        "title": "Weekend Box Office: The Marvels bombs",
        "description": "Box Office: 'The Marvels' Misfires With $47 Million, Lowest MCU Opening Weekend of All Time https://t.co/zVOUZMETVg\r\n— Variety (@Variety) November 12, 2023The Marvels may have nabbed top spot at the box office this weekend, but that point is the only good thi…",
        "url": "https://ohnotheydidnt.livejournal.com/127221213.html",
        "urlToImage": "https://l-stat.livejournal.net/img/sign.png",
        "publishedAt": "2023-11-12T17:25:05Z",
        "content": "Box Office: 'The Marvels' Misfires With $47 Million, Lowest MCU Opening Weekend of All Time https://t.co/zVOUZMETVg\r\n— Variety (@Variety) November 12, 2023\r\nThe Marvels may have nabbed top spot at th… [+1442 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Paul Tassi, Senior Contributor, \n Paul Tassi, Senior Contributor\n https://www.forbes.com/sites/paultassi/",
        "title": "Who Would Join The Marvels’ Kamala Khan ‘Young Avengers’ Squad?",
        "description": "The Marvels is the first step in finally setting up the Young Avengers, and here's who would be on the squad.",
        "url": "https://www.forbes.com/sites/paultassi/2023/11/12/who-would-join-the-marvels-kamala-khan-young-avengers-squad/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/62cedc9b0a0ac79e661cb76c/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
        "publishedAt": "2023-11-12T15:54:48Z",
        "content": "Ms. Marvel\r\nDisney\r\nThe Marvels just wrapped up an underwhelming weekend through, I would argue, no fault of its own. But it is an MCU project with some important implications, and you dont get erase… [+3470 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "ComingSoon.net"
        },
        "author": "Jonathan Sim",
        "title": "The Marvels Review: An Uneven MCU Mess",
        "description": "Recently, a Variety article detailed a “crisis” happening with the Marvel Cinematic Universe, the superhero franchise that has dominated pop culture for the past 15 years. A few days later, The Marvels flies into theaters, a film that faced reshoots after mix…",
        "url": "https://www.comingsoon.net/movies/reviews/1393980-the-marvels-review-an-uneven-mcu-mess",
        "urlToImage": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/11/GRO-09769_R.jpg?resize=1200,630",
        "publishedAt": "2023-11-09T16:00:00Z",
        "content": "Recently, a Variety article detailed a crisis happening with the Marvel Cinematic Universe, the superhero franchise that has dominated pop culture for the past 15 years. A few days later, The Marvels… [+7390 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Deadline"
        },
        "author": "Nancy Tartaglione",
        "title": "‘The Marvels’ Projected $110M-$115M Worldwide Debut An All-Time Low For Disney MCU",
        "description": "Remember the bright shining light that was Captain Marvel when she showed up to shepherd Tony Stark to safety in the first few minutes of 2019’s Avengers: Endgame? Well, judging by this weekend’s projections for Carol Danvers’ latest outing, that light has di…",
        "url": "https://deadline.com/2023/11/the-marvels-opening-global-international-box-office-1235600417/",
        "urlToImage": "https://deadline.com/wp-content/uploads/2023/11/M230918_WD003.jpg?w=1024",
        "publishedAt": "2023-11-11T19:50:44Z",
        "content": "Remember the bright shining light that was Captain Marvel when she showed up to shepherd Tony Stark to safety in the first few minutes of 2019’s Avengers: Endgame? Well, judging by this weekend’s pro… [+1679 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "IndieWire"
        },
        "author": "Tom Brueggemann",
        "title": "‘The Marvels’ Will Become the First MCU Title to Fall Short of $100 Million Domestic",
        "description": "In happier box-office news, \"The Hunger Games: Ballad of Songbirds and Snakes\" opened well while \"Saltburn\" and \"Fallen Leaves\" had strong limited debuts.",
        "url": "https://www.indiewire.com/news/box-office/the-marvels-first-mcu-title-fall-short-100-million-1234927842/",
        "urlToImage": "https://www.indiewire.com/wp-content/uploads/2023/11/MCDHUGA_LG025.jpg",
        "publishedAt": "2023-11-19T19:05:09Z",
        "content": "Franchise entries “Hunger Games: The Ballad of Songbirds and Snakes” (Lionsgate) and “Trolls Band Together” (Universal) opened to respectable levels, if below their precedents, to take #1 and #2 in t… [+7211 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Hannah Shaw-Williams)",
        "title": "The Marvels Box Office Goes From Bad To Worse With Catastrophic Second Weekend Drop",
        "description": "The Marvels sets another unenviable box office record as it heads for the Marvel Cinematic Universe&amp;#39;s biggest ever second weekend drop.",
        "url": "https://www.slashfilm.com/1450417/marvels-biggest-second-weekend-box-office-drop-mcu/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-box-office-goes-from-bad-to-worse-with-record-breaking-second-weekend-drop/l-intro-1700333402.jpg",
        "publishedAt": "2023-11-18T19:28:58Z",
        "content": "As \"The Hunger Games\" franchise makes a big for a comeback with prequel movie \"The Ballad of Songbirds &amp; Snakes,\" the Marvel Cinematic Universe's woes continue. After setting a new franchise low … [+1547 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Ryan Scott)",
        "title": "The Marvels Just Had The Biggest Second Weekend Drop Ever For A Superhero Movie",
        "description": "The Marvel Cinematic Universe is good and truly in trouble, with The Marvels collapsing at the box office in its second weekend.",
        "url": "https://www.slashfilm.com/1451537/the-marvels-biggest-second-weekend-drop-ever-superhero-movie/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-just-had-the-biggest-second-weekend-drop-ever-for-a-superhero-movie/l-intro-1700507943.jpg",
        "publishedAt": "2023-11-20T20:00:39Z",
        "content": "The situation with \"The Marvels\" has gone from bad to record-breaking levels of bad. The latest entry in the Marvel Cinematic Universe opened last weekend to a pretty underwhelming $46.1 million, whi… [+1626 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Mark Hughes, Contributor, \n Mark Hughes, Contributor\n https://www.forbes.com/sites/markhughes/",
        "title": "‘The Marvels’ Makes Box Office History, ‘The Hunger Games’ Eyes #1 Spot",
        "description": "What cost \"The Marvels\" the box office crown for November, and will \"The Hunger Games: The Ballad of Songbirds and Snakes\" become the month's box office royalty?",
        "url": "https://www.forbes.com/sites/markhughes/2023/11/16/the-marvels-makes-box-office-history-the-hunger-games-eyes-1-spot/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/655599a3039693c028c14a3f/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
        "publishedAt": "2023-11-16T13:00:00Z",
        "content": "While Marvel Studios expected The Marvels to blast off to higher box office last weekend, the Captain Marvel sequel from Nia DaCosta still topped the box office for the weekend and officially became … [+7388 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Biztoc.com"
        },
        "author": "hollywoodreporter.com",
        "title": "Box Office: ‘Hunger Games’ Prequel Opening to $45M-$50M, ‘The Marvels’ Suffers Historic Drop",
        "description": "Tom Blyth and Rachel Zegler in 'The Hunger Games: The Ballad of Songbirds and Snakes.' Lionsgate’s prequel The Hunger Games: The Ballad of Songbirds & Snakes is headed for a $45 million-plus opening at the domestic box office after earning $19.1 million on Fr…",
        "url": "https://biztoc.com/x/dbe2b4b0d256259f",
        "urlToImage": "https://c.biztoc.com/p/dbe2b4b0d256259f/s.webp",
        "publishedAt": "2023-11-18T16:22:21Z",
        "content": "Tom Blyth and Rachel Zegler in 'The Hunger Games: The Ballad of Songbirds and Snakes.'Lionsgates prequel The Hunger Games: The Ballad of Songbirds &amp; Snakes is headed for a $45 million-plus openin… [+322 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Brian Bushard, Forbes Staff, \n Brian Bushard, Forbes Staff\n https://www.forbes.com/sites/brianbushard/",
        "title": "Box Office Woes: ‘Hunger Games,’ ‘Trolls’ And ‘The Marvels’ On Pace For Lowest Grosses In Franchise History",
        "description": "“The Hunger Games: The Ballad of Songbirds and Snakes” grossed $5.75 million in its U.S. preview, and its odds of matching its predecessors’ strong openings are not in its favor.",
        "url": "https://www.forbes.com/sites/brianbushard/2023/11/17/box-office-woes-hunger-games-trolls-and-the-marvels-on-pace-for-lowest-grosses-in-franchise-history/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6557d1b3e1d11d17d71ed287/0x0.jpg?format=jpg&crop=2244,1261,x0,y0,safe&height=900&width=1600&fit=bounds",
        "publishedAt": "2023-11-17T20:56:50Z",
        "content": "The Hunger Games: The Ballad of Songbirds and Snakes grossed $5.75 million in its domestic previews, Deadline and Variety reported, putting the long-awaited prequel on pace for the movie franchises w… [+3166 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Jenna Busch)",
        "title": "The Marvels' Young Avengers Tease Originally Featured More Characters [Exclusive]",
        "description": "The Marvels star Iman Vellani has confirmed that she shot a different version of the film&amp;#39;s Young Avengers tease than the one that made the theatrical cut.",
        "url": "https://www.slashfilm.com/1446963/the-marvels-young-avengers-tease-originally-featured-more-characters/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-young-avengers-tease-originally-featured-more-characters-exclusive/l-intro-1700051741.jpg",
        "publishedAt": "2023-11-15T13:45:30Z",
        "content": "We may end up getting to see the banter between Kate Bishop and Kamala Khan in the film's home media release or a Disney+ special. Considering these two are my absolute favorites of the Young Avenger… [+1201 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "GameSpot"
        },
        "author": "David Wolinsky",
        "title": "Iman Vellani On The Marvels Box Office Struggles: \"That's For Bob Iger\"",
        "description": "Iman Vellani, back as Kamala Khan/Ms. Marvel in The Marvels, remains unfazed by the film's box office performance since its November 10 release--it opened to $47 million domestically and just under $100 million worldwide, marking the weakest start for a Marve…",
        "url": "https://www.gamespot.com/articles/iman-vellani-on-the-marvels-box-office-struggles-thats-for-bob-iger/1100-6519328/",
        "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1600/16003485/4223217-4217565-the-marvels-captain-marvel-2-poster-international.jpg",
        "publishedAt": "2023-11-20T17:46:00Z",
        "content": "Iman Vellani, back as Kamala Khan/Ms. Marvel in The Marvels, remains unfazed by the film's box office performance since its November 10 release--it opened to $47 million domestically and just under $… [+1614 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "The A.V. Club"
        },
        "author": "Sam Barsanti",
        "title": "It’s not Iman Vellani’s problem that The Marvels is a bomb",
        "description": "Marvel’s The Marvels is having a pretty lousy time at the box office, having already gotten the worst opening in MCU history and then a huge drop-off in its second week, but star Iman Vellani—who plays Ms. Marvel, a.k.a. Kamala Khan—isn’t phased by it. In fac…",
        "url": "https://www.avclub.com/not-iman-vellani-s-problem-that-the-marvels-is-a-bomb-1851037050",
        "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/8a3002c7c1549189a251085f2e68a793.jpg",
        "publishedAt": "2023-11-20T22:16:00Z",
        "content": "Marvels The Marvelsis having a pretty lousy time at the box office, having already gotten the worst opening in MCU history and then a huge drop-off in its second week, but star Iman Vellaniwho plays … [+1612 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Screen Rant"
        },
        "author": "Lukas Shayo",
        "title": "Hunger Games Prequel Shoots Past The Marvels For The #1 Spot At The Box Office",
        "description": "The Hunger Games prequel, The Ballad of Songbirds and Snakes, officially shoots past The Marvels to secure the #1 spot at the weekend box office.",
        "url": "https://screenrant.com/hunger-games-ballad-songbirds-snakes-opening-box-office-marvels-beat/",
        "urlToImage": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/11/lucy-and-snow-in-ballad-of-songbirds-and-snakes.jpg",
        "publishedAt": "2023-11-18T18:36:31Z",
        "content": "Summary\r\n<ul><li>The Hunger Games: The Ballad of Songbirds and Snakes has claimed the top spot at the box office, beating out its competitors. </li><li> This prequel adaptation explores the early lif… [+3125 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Witney Seibold)",
        "title": "The Marvels Star Iman Vellani Made An Adorable 'Mortal Enemy' On Set [Exclusive]",
        "description": "Iman Vellani plays the superhero Ms. Marvel in The Marvels, but her real arch-nemesis is one of her adorable co-stars.",
        "url": "https://www.slashfilm.com/1447093/the-marvels-star-iman-vellani-adorable-mortal-enemy-exclusive/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-star-iman-vellani-made-an-adorable-mortal-enemy-on-set-exclusive/l-intro-1700051821.jpg",
        "publishedAt": "2023-11-15T22:00:00Z",
        "content": "But, first, yes, those were real kittens on set, and, yes, they were indeed distracting to their bipedal counterparts. Vellani even recalled that actor Mohan Kapur, who plays Kamala's dad, Yusuf, was… [+1437 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (Witney Seibold)",
        "title": "The Marvels Star Iman Vellani Says The Box Office Is Disney CEO Bob Iger's Problem",
        "description": "The Marvels&amp;#39; Imran Vellani has wise words for those who wonder what she thinks about the MCU movie&amp;#39;s box office performance.",
        "url": "https://www.slashfilm.com/1451806/the-marvels-iman-vellani-box-office-disney-ceo-bob-iger-problem/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-star-iman-vellani-says-the-box-office-is-disney-ceo-bob-igers-problem/l-intro-1700521910.jpg",
        "publishedAt": "2023-11-20T23:45:53Z",
        "content": "Iman Vellani even called out Disney CEO Bob Iger by name, saying: \"I don't want to focus on something that's not even in my control, because what's the point? [...] That's for Bob Iger.\"\r\nPrior to th… [+1449 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "/FILM"
        },
        "author": "staff@slashfilm.com (BJ Colangelo)",
        "title": "The Marvels Mid-Credits Scene Gave Iman Vellani A 'Heart Attack' [Exclusive]",
        "description": "The Marvels star Iman Vellani is a fan of the MCU, so when she saw the mid-credits scene of her movie, she fangirled out for real.",
        "url": "https://www.slashfilm.com/1447117/the-marvels-mid-credits-scene-iman-vellani-heart-attack-exclusive/",
        "urlToImage": "https://www.slashfilm.com/img/gallery/the-marvels-mid-credits-scene-gave-iman-vellani-a-heart-attack-exclusive/l-intro-1700007340.jpg",
        "publishedAt": "2023-11-15T12:00:00Z",
        "content": "\"I read the script, but they wrote a different name,\" she tells Anderton. \"It wasn't Beast, so I didn't know they were filming that.\" Vellani didn't tell Anderton who the different name was. Still, i… [+1347 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "IndieWire"
        },
        "author": "Christian Zilko",
        "title": "Iman Vellani Shrugs Off ‘The Marvels’ Box Office Woes: ‘That’s for Bob Iger’",
        "description": "The \"Ms. Marvel\" star isn't losing sleep over the profitability of her big screen debut.",
        "url": "https://www.indiewire.com/news/general-news/iman-vellani-the-marvels-box-office-bob-iger-problem-1234927944/",
        "urlToImage": "https://www.indiewire.com/wp-content/uploads/2023/11/MCDMARV_WD040.jpg",
        "publishedAt": "2023-11-20T00:00:00Z",
        "content": "Years of gradually declining box office numbers for the Marvel Cinematic Universe have led many fans and filmmakers to wonder if superhero fatigue had begun to set in among moviegoers. But while disa… [+1942 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "BGR"
        },
        "author": "Jacob Siegal",
        "title": "The Marvels flopping is more proof that the MCU is on life support",
        "description": "Before The Marvels premiered on November 10th, I figured the bleak projections would end up being an overreaction. After all, Pixar’s Elemental looked like a …\nThe post The Marvels flopping is more proof that the MCU is on life support appeared first on BGR.",
        "url": "https://bgr.com/entertainment/the-marvels-flopping-is-more-proof-that-the-mcu-is-on-life-support/",
        "urlToImage": "https://bgr.com/wp-content/uploads/2023/11/The-Marvels.jpg?quality=82&strip=all",
        "publishedAt": "2023-11-21T00:06:00Z",
        "content": "Before The Marvels premiered on November 10th, I figured the bleak projections would end up being an overreaction. After all, Pixar’s Elemental looked like a flop on its opening weekend but went on t… [+3581 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Space.com"
        },
        "author": "Kimberley Snaith",
        "title": "Save 20% on Lego's Hoopty spaceship from The Marvels this Black Friday",
        "description": "Grab yourself an $18 saving on this fun Lego ship from The Marvels this Black Friday.",
        "url": "https://www.space.com/lego-the-marvels-hoopty-spaceship-black-friday-2023",
        "urlToImage": "https://cdn.mos.cms.futurecdn.net/N7uxGtTocxscvc45kVAHN4-1200-80.jpg",
        "publishedAt": "2023-11-24T21:45:39Z",
        "content": "Space is part of Future US Inc, an international media group and leading digital publisher. Visit our corporate site.\r\n©\r\nFuture US, Inc. Full 7th Floor, 130 West 42nd Street,\r\nNew York,\r\nNY 10036."
    },
    {
        "source": {
            "id": null,
            "name": "Screen Rant"
        },
        "author": "Brennan Klein",
        "title": "The Marvels Box Office Plummets, Breaking Another Unfortunate MCU Record",
        "description": "The new MCU sequel The Marvels struggles to maintain a foothold at the domestic box office, breaking another negative franchise record.",
        "url": "https://screenrant.com/the-marvels-box-office-week-3-rank-mcu-record/",
        "urlToImage": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/11/brie-larson-as-captain-marvel-giving-side-eye-in-the-marvels.jpg",
        "publishedAt": "2023-11-25T20:34:27Z",
        "content": "Summary\r\n<ul><li> The Marvels, the latest MCU film, is struggling at the box office, having the lowest opening weekend and steepest week 2 drop in the franchise's history. </li><li> In its third week… [+3094 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Forbes"
        },
        "author": "Paul Tassi, Senior Contributor, \n Paul Tassi, Senior Contributor\n https://www.forbes.com/sites/paultassi/",
        "title": "The Marvels’ Director Has Been Unfairly Maligned For Months Now",
        "description": "The Marvels' Nia DaCosta has been relentlessly dragged all throughout this process by both some MCU fans and even some of the highest profile entertainment publications on the market.",
        "url": "https://www.forbes.com/sites/paultassi/2023/11/21/the-marvels-director-has-been-unfairly-maligned-for-months-now/",
        "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/654cf06ffe1ee312c00c2b74/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
        "publishedAt": "2023-11-21T14:14:55Z",
        "content": "The Marvels\r\nMCU\r\nThe Marvels is a box office bomb, at least on the scale of an MCU feature. The lowest opening MCU ever, likely headed for the lowest global total. And yet it did set one record, the… [+4531 chars]"
    },
    {
        "source": {
            "id": null,
            "name": "Deadline"
        },
        "author": "Ryan Fleming",
        "title": "‘Poor Things’, ‘The Marvels’ And ‘Barbie’ Production Designers On Creating Fantastical New Worlds Through Innocent Eyes",
        "description": "In most fantasy movies, the job of the production team is to create a breathtaking new world that dazzles the viewer, but this Oscar season shows a new trend: stories in which the characters themselves are taken on a journey of discovery and adventure. In Poo…",
        "url": "https://deadline.com/2023/11/poor-things-the-marvels-barbie-production-design-feature-magazine-1235637437/",
        "urlToImage": "https://deadline.com/wp-content/uploads/2023/11/Poor-Things-01.jpg?w=1024",
        "publishedAt": "2023-11-25T19:02:00Z",
        "content": "In most fantasy movies, the job of the production team is to create a breathtaking new world that dazzles the viewer, but this Oscar season shows a new trend: stories in which the characters themselv… [+7565 chars]"
    }
]